{
  "patent_AU2022324018A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method and system for newborn screening for genetic diseases by whole genome sequencing\n- **Publication No.:** AU2022324018A1\n- **Publication Date:** 2023-02-02\n- **Link:** https://patents.google.com/patent/AU2022324018A1/en\n\n#### Abstract (excerpt)\n\n> \"The present disclosure provides a method and system for testing newborns for genetic diseases, diagnoses and implementing optimal treatments. The invention provides for rapid detection of genetic disease in newborns, as well as identification of available therapeutic interventions that may be rapidly implemented to prevent death or adverse complications characterized by the genetic disease.\"\n\n#### Relevant Overlaps\n\n- Both this patent and Quant involve genome-wide analysis using sequencing data to identify disease-causing genetic variants.\n- The patent describes a method of determining sets of pathogenic/likely pathogenic variants in genes associated with genetic diseases and comparing patient variant diplotypes against these sets to identify whether the subject screens positive for a treatable genetic disease.\n- Incorporates population allele frequencies of variants to filter or prioritize variants, akin to Quant’s use of variant frequencies.\n- Considers inheritance modes (autosomal dominant, autosomal recessive, X-linked) and assesses variants in the context of diplotypes, consistent with Quant’s modeling of inheritance.\n- Emphasizes rapid whole genome sequencing and automated or autonomous interpretation and reporting, which overlaps with Quant’s goal of scalable genome-wide probabilistic diagnosis.\n- The method updates variant pathogenicity assessments and allele frequencies based on results and confirmatory testing, which shares the concept of feedback-informed learning.\n- Includes an automated platform performing natural language processing (NLP) of clinical records, mapping clinical phenotypes to ontology terms (e.g., HPO), and integrating genotype and phenotype data to generate a prioritized list of provisional diagnoses.\n- Uses Bayesian or probabilistic models (e.g., MOON software) for variant and phenotype integration, in line with Quant’s Bayesian posterior probability computation.\n- The invention provides reports including ranked variant and gene scores, lists of potential differential diagnoses, and treatment guidance linked to diagnosed genetic diseases, overlapping Quant’s end-user reports on probabilistic disease diagnosis and credible intervals for diagnostic certainty.\n- Addresses false positives and negatives through statistical thresholds and confirmatory testing, echoing Quant’s explicit modeling of false negatives (missing data) probabilities.\n- The system is designed for newborn screening and clinical diagnosis, matching Quant’s target clinical use cases.\n\n#### Key Differences\n\n- The patent does not clearly disclose the explicit and formal computation of prior probabilities of disease-causing variants genome-wide under Hardy-Weinberg equilibrium, which Quant uses as a cornerstone.\n- Quant explicitly integrates prior probabilities with observed and missing variant data to compute a Bayesian posterior confidence of a complete genetic diagnosis; in contrast, while the patent mentions Bayesian models and automated ranking, it does not emphasize the probabilistic quantification of genome-wide prior pathogenic variant frequencies and false negative probabilities in the same explicit manner.\n- Quant uniquely provides credible intervals quantifying uncertainty of diagnostic results; the patent emphasizes ranked lists and likelihoods but does not explicitly discuss credible intervals or diagnostic confidence intervals.\n- The patent is broader in scope, focusing on a comprehensive system integrating sequencing, NLP phenotyping, variant calling, interpretation, and treatment guidance, but does not detail the aggregation of variant-level priors into gene-level probabilities nor the formal treatment of unobserved data (false negatives) as Quant does.\n- The patent’s Bayesian and AI models appear to primarily prioritize variant pathogenicity and phenotype fit rather than explicitly modeling true positive (TP), false positive (FP), true negative (TN), and false negative (FN) scenarios per variant or gene as Quant does.\n- Both rely heavily on public databases (ClinVar, gnomAD, OMIM), but Quant’s innovation is in how these data are combined probabilistically across the genome for diagnostic certainty rather than solely variant classification and phenotypic ranking.\n- The patent places strong emphasis on practical clinical utility (e.g. rapid treatment guidance for ICU cases), whereas Quant’s unique focus is on the quantitative probability framework for the genetic diagnosis confidence.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**\n\nWhile the patent and Quant share many methodological elements common in genomic diagnostics such as use of population variant frequencies, pathogenicity classifications, inheritance mode considerations, and AI-based phenotype integration, the fundamental conceptual novelty of Quant—computing genome-wide prior probabilities combined with observed and unobserved variant data to derive a Bayesian posterior probability with credible intervals of a full genetic diagnosis—is not explicitly or clearly claimed in the patent. The patent discloses automated variant prioritization and diagnosis with treatment guidance but does not appear to address or claim the core theoretical framework of Quant related to prior/posterior integration and false negative modeling across the entire genome. Nevertheless, the overlap in potential applications and some algorithmic approaches indicates that a detailed legal analysis is warranted to delineate boundaries and freedom to operate."]
  },
  "patent_AU2023282218B2": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Systems and methods for leveraging relatedness in genomic data analysis\n- **Publication No.:** AU2023282218B2\n- **Publication Date:** 2023-01-12\n- **Link:** https://patents.google.com/patent/AU2023282218B2/en\n\n#### Abstract (excerpt)\n\n> \"Methods, non-transitory computer-implemented methods and systems for identifying compound heterozygous mutations (CHMs) and de novo mutations (DNMs) in populations are provided. Also provided are methods for phasing genetic variants in a population by leveraging the population's relatedness.\"\n\n#### Relevant Overlaps\n\n- The patent describes methods for:\n  - Phasing genetic variants in populations using relatedness and identity-by-descent (IBD) estimates.\n  - Identifying compound heterozygous mutations (CHMs) by phasing candidate variants as cis or trans.\n  - Identifying de novo mutations (DNMs) using genotype likelihoods and pedigree structures.\n  - Filtering variants using quality metrics such as Hardy-Weinberg equilibrium violation, read depth, allele balance, and quality-by-depth.\n  - Scoring CHMs based on functional effect priority to select highest impact variants per gene per individual.\n\n- These steps reflect key technical methods similar to Quant’s approach, especially:\n  - Use of identity-by-descent and family structure for variant phasing (beyond population frequency).\n  - Explicit phasing of CHMs to infer trans vs cis configuration.\n  - Use of various QC filters on variants similar to those used by Quant.\n  - Identification and classification of DNMs within trios and filtering by genotype quality, allele balance, and read depth.\n  \n- The patent thoroughly integrates relatedness and family network information in variant interpretation, distinguishing their approach from population-frequency-only phasing methods.\n\n#### Key Differences\n\n- The patent focuses on:\n  - Leveraging pedigree and relatedness data primarily to phase variants as CHMs or identify DNMs in large population-based cohorts.\n  - Emphasis is on identification of CHMs and DNMs and their filtering/prioritization, not on integrating prior probabilities genome-wide or modeling false negatives explicitly.\n  - Does not explicitly describe computing probabilistic diagnostic certainty incorporating false negative probabilities or Bayesian integration of priors and observations as in Quant.\n  - The focus is on phasing and variant classification using relatedness rather than the genome-wide prior and posterior disease probability framework Quant offers.\n  \n- Quant’s core innovation lies in quantifying genome-wide prior probabilities of disease-causing variants and combining these with observed and unobserved data to produce Bayesian posterior probabilities of genetic diagnosis, including credible intervals of certainty.\n\n- Patent’s use of scoring CHMs is more about phenotype severity or functional effect priority rather than a Bayesian posterior probability of diagnosis certainty.\n\n- Quant explicitly models false negative rates and integrates unobserved data in diagnosis confidence, which is not apparent in this patent.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis patent discloses computational methods that leverage population relatedness and identity-by-descent to phase variants as compound heterozygous mutations and identify de novo mutations with extensive variant filtering. These techniques resemble several components of Quant’s methodology, particularly in employing family and relatedness data for phasing and mutation classification. However, Quant’s unique innovation of integrating genome-wide prior probabilities with observed and missing variant data into a Bayesian posterior probability of complete genetic diagnosis (including modeling false negatives and offering credible intervals) is not explicitly covered in this patent. The overlap is significant regarding methods of relatedness-based phasing of CHMs and DNM identification but does not clearly extend to Quant’s distinctive Bayesian diagnostic confidence quantification. Hence, a detailed legal review is recommended to clarify the scope of overlap and freedom-to-operate."]
  },
  "patent_CA3227737A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method and system for newborn screening for genetic diseases by whole genome sequencing\n- **Publication No.:** CA3227737A1\n- **Publication Date:** 2022-07-07\n- **Link:** https://patents.google.com/patent/CA3227737A1/en\n\n#### Abstract (excerpt)\n\n> \"The present disclosure provides a method and system for testing newborns for genetic diseases, diagnoses and implementing optimal treatments. The invention provides for rapid detection of genetic disease in newborns, as well as identification of available therapeutic interventions that may be rapidly implemented to prevent death or adverse complications characterized by the genetic disease.\"\n\n#### Relevant Overlaps\n\n- The invention performs **genome-wide sequencing** (WGS/rWGS) on newborn or infant samples.\n- Automates the analysis pipeline, including **variant calling, annotation, and interpretation**.\n- Uses phenotype data extraction via **natural language processing (CNLP) of electronic health records (EHRs)** to generate phenotypic features.\n- Compares phenotypic features to known phenotypes of genetic diseases to generate differential diagnoses.\n- Employs a **ranking system of genetic diagnoses** combining phenotypic similarity and variant pathogenicity.\n- Incorporates a **virtual management guidance system** (Genome-to-Treatment, GTRx™) linking diagnoses to curated, expert-reviewed therapeutic interventions.\n- Considers inheritance mode and diplotypes, including compound heterozygosity, recessive/dominant/X-linked patterns.\n- Implements **feedback loops and self-learning**: population allele frequency recalculation, variant pathogenicity updating based on confirmatory testing.\n- Employs **automated confirmatory testing and updates variant pathogenicity calls** accordingly.\n- Supports **rapid turnaround (13.5-20 hours)** for diagnosis and clinical reporting.\n- Uses **Bayesian and AI models** (MOON™, GEM™, etc.) for variant interpretation including phenotype-genotype integration.\n- The technology is intended for **population-scale newborn screening and diagnosis** with scalability and automated workflows.\n- The method includes identifying **true positives (TP), false positives (FP), false negatives (FN), and true negatives (TN)** to refine variant lists and improve accuracy.\n- Supports multiple sequencing input types (blood, dried blood spot, saliva) and multigenerational samples (trios).\n- Provides probability-based confidence (credible intervals) in diagnosis and management recommendations.\n- The system includes a **sparse database structure** to efficiently handle genotype frequencies and the n+1 problem in population data.\n- Covers **hundreds of genes and hundreds of childhood-onset, severe genetic diseases with effective treatments**.\n\n#### Key Differences\n\n- While Quant specifically emphasizes calculation of **prior probabilities of disease-causing variants genome-wide combined with modeling of false negatives (missing variants) to derive Bayesian posterior probabilities of a complete genetic diagnosis**, the patent focuses more broadly on **using phenotype-genotype correlations and variant pathogenicity classification to generate provisional diagnoses and link to treatment guidance**.\n- The patent incorporates **natural language processing of EHRs for phenotype extraction**, a feature not central to Quant’s described method.\n- Quant elaborates specifically on **integration of Hardy-Weinberg expectations and prior probabilities across all genes and modes of inheritance** to compute gene- and variant-level probabilities, which is less explicitly addressed in the patent text that focuses on variant filtering, ranking, and management guidance.\n- The patent mainly addresses **newborn screening and rapid diagnosis workflows at a population scale**, with dynamic variant/pathogenicity updating through a learning feedback loop, whereas Quant focuses more on the **statistical modeling of TP, FP, TN, FN variant observations to compute Bayesian posterior diagnostic confidence with credible intervals**.\n- Quant highlights that many prior tools only classify variants as pathogenic/benign, whereas it quantifies diagnostic confidence incorporating **uncertainty from false negatives and unobserved variation**. The patent does not explicitly disclose such a statistical modeling framework focusing on false negative probabilities or credible interval reporting.\n- The patent describes also clinical natural language processing and expert-curated treatment databases as novel innovations, which are separate from Quant’s core computational model.\n- Quant does not primarily rely on EHR-derived phenotypes or AI ranking tools trained on literature, while the patent deeply integrates these for diagnosis and management.\n- The patent system includes provisions for re-analyses, updating pathogenicity assertions based on clinical confirmatory tests, while Quant focuses on initial calculation of diagnostic confidence with integration of missing variant probabilities.\n- Quant is described as a software framework for **quantifying genetic diagnosis probability over all human genes and inheritance modes**, whereas the patent describes a **method and system specifically for newborn screening and clinical management guidance**.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n*Rationale:* The patent describes comprehensive methods for rapid genetic disease diagnosis and newborn screening using whole genome sequencing, integrating variant pathogenicity, inheritance mode, phenotype-driven prioritization, confirmatory testing, and dynamic variant pathogenicity updating. These overlap multiple aspects of Quant’s technology, especially in utilizing diplotypes, inheritance modes, variant frequencies, and integrating clinical evidence to generate diagnostic reports. Although the patent also adds unique components like CNLP phenotype extraction and detailed treatment curation, its core of integrating variant pathogenicity with sequencing data for diagnosis at population scale parallels the fundamental Bayesian combination of observed variant evidence and disease probabilities in Quant, particularly with respect to how true positives and false positives/negatives are iteratively incorporated and how diplotype allele frequencies are recalculated dynamically. Given the similarity in purpose, scale, and some aspects of the diagnostic inference method (using variant types and inheritance modes, and evaluation of TP, FP, TN, FN outcomes), this patent may pose a blocking issue or have claim scope overlapping key elements of Quant’s approach. Careful legal review focusing on claims and exact claim limitations compared to Quant’s unique Bayesian modeling of missing data and diagnostic confidence intervals is warranted."]
  },
  "patent_CA3233198A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method of characterising a dna sample  \n- **Publication No.:** CA3233198A1  \n- **Publication Date:** 2018-06-08  \n- **Link:** https://patents.google.com/patent/CA3233198A1/en\n\n#### Abstract (excerpt)\n\n> \"A method of characterising a DNA sample obtained from a tumour, the method including the steps of: (a) obtaining a tumour copy number profile for the sample, (b) quantifying a set of copy number features of the copy number profile, and (c) determining exposure to one or more signatures of chromosomal instability based on the quantified features. A copy number feature is a metric that characterises a copy number event in a copy number profile. The set of features does not comprise the absolute copy number of segments in the copy number profile.\"\n\n#### Relevant Overlaps\n\n- Both this patent and Quant analyze copy number profiles obtained from tumour DNA samples.\n- Both quantify copy number features that exclude absolute copy number of segments, including segment size, breakpoint counts, copy number changepoints, and oscillating segment patterns.\n- Both identify signatures of chromosomal instability (CIN) derived by quantifying these copy number features across multiple tumour samples.\n- Both use matrix factorization (non-negative matrix factorization) or equivalent statistical methods to decompose copy number feature data into signatures and compute exposures to these signatures.\n- Both characterize tumour samples by their exposure to CIN signatures which represent underlying mutational processes.\n- The patent describes use of Bayesian/variational mixture models to generate component distributions, posterior probability-based feature summarization, and thresholding to call signature presence.\n- The patent includes extensive downstream applications: predicting tumour properties, prognostics, drug response prediction, and drug target identification based on signature exposures.\n- Particularly, the patent emphasizes nuanced integration of multiple copy number features and their distributions, avoiding reliance on absolute copy number; this is consonant with Quant’s approach to robust Bayesian modeling of genome-wide variant observation probabilities based on detailed prior and observed data.\n- The patent analyzes all CIN states genome-wide for multiple tumour types, akin to Quant’s genome-wide modelling across inheritance modes.\n- Both consider uncertainty and generate confidence intervals or credible intervals reflecting diagnostic/genomic characterization certainty.\n- The patent also explicitly models outcomes related to true positive and false negative observations in copy number calling, accommodating incomplete or noisy data indirectly via probabilistic mixture models.\n- Quant’s innovation of integrating observed variants, false negative probabilities, and prior probabilities into a Bayesian posterior is conceptually analogous to the patent’s probabilistic modeling of copy number features into signatures and their exposures.\n- Though not identical in biological focus (the patent centers on CIN signatures, Quant on variant pathogenicity probabilities), the underlying statistical framework — Bayesian mixture modeling, prior feature distributions, posterior exposure computations — is very similar, and there is strong conceptual and methodological overlap.\n\n#### Key Differences\n\n- The patent focuses on characterizing tumours specifically via copy number signatures of chromosomal instability and their clinical/biological correlates.\n- Quant focuses on genome-wide variant-level pathogenicity probabilities, integrating population-level allele frequencies, mode of inheritance, variant observations including false negatives, to quantify the probability of a pathogenic variant presence and diagnosis confidence.\n- The patent’s focus is on high-level copy number features as proxies for general CIN mutational processes, not specifically integrating true/false positive variant detection at the variant level as in Quant.\n- Quant integrates observed sequence variant calls (SNVs/indels) and population data, whereas the patent is based on copy number profiles primarily derived from SNP arrays or sequencing.\n- The patent does not address a Bayesian framework combining prior population variant pathogenicity with observed TP/FN variant calls per se; its Bayesian elements center on mixture models for feature distributions.\n- Quant’s novelty lies in Bayesian posterior probabilities for genetic diagnoses integrating prior probabilities, variant observation, and false negative probabilities genome-wide; the patent emphasizes characterization of chromosomal instability signatures from copy number data.\n- The patent mentions broad clinical applications such as drug target identification and prognosis, whereas Quant’s clinical novelty is in quantitative confidence of genetic diagnosis.\n- No explicit mention in the patent of concepts of TP, FN, TN, FP for variant detection or diagnosis certainty intervals akin to Quant’s core innovation.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThis patent fundamentally covers a method for characterizing tumour DNA samples by quantifying copy number features (excluding absolute segment copy number) and interpreting them via chromosomal instability signatures derived probabilistically by Bayesian mixture and factorization methods, closely mirroring the statistical and theoretical basis of Quant’s approach to probabilistic genomic variant interpretation. Albeit differences in biological focus and application scope exist, the underlying principles in feature quantification, mixture modeling, signature derivation, and sample characterization show strong similarity. Quant’s Bayesian modeling of TP, FN, and diagnosis confidence is conceptually related to the patent’s Bayesian posterior modeling of copy number feature exposures. Therefore, this patent poses a potentially blocking or overlapping claim on core computational/statistical strategies underlying Quant, meriting a detailed legal review to ascertain FTO."]
  },
  "patent_CN116194995A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method for identifying chromosomal dimensional instability such as homologous repair defects in next generation sequencing data of low coverage\n- **Publication No.:** CN116194995A\n- **Publication Date:** 2021-08-27\n- **Link:** https://patents.google.com/patent/CN116194995A/en\n\n#### Abstract (excerpt)\n\n> \"The genomic data analyzer may be configured to detect and characterize the presence of genomic instability in a tumor sample using a machine learning model, such as a trained convolutional neural network. Genomic data analyzers can use whole genome sequencing reads as input data, even at low sequencing coverage in high throughput sequencing workflows often employed in various clinical oncology settings. The genomic data analyzer may arrange the aligned read data coverage from the chromosome arms or whole chromosomes to form an array of coverage data signals, possibly in the form of an image. The trained machine learning model may process the coverage data signal array to determine whether chromosomal dimensional instability (CSI), such as genomic instability caused by homologous repair or recombination defects (HRDs), is present in the tumor sample.\"\n\n#### Relevant Overlaps\n\n- Both Quant and this patent utilize genome-wide sequencing data, including low-pass or low-coverage whole genome sequencing (0.1X to 30X coverage).\n- Both employ dividing the genome into blocks/tiles corresponding to chromosome arms and generating normalized coverage signals per block.\n- Both arrange coverage signals into multi-dimensional arrays or \"images\" aligned along chromosome centromeres or telomeres for spatial pattern recognition.\n- Use of trained machine learning models, particularly convolutional neural networks (CNNs), to infer genomic instability or homologous recombination defect (HRD) status from spatially arranged coverage data.\n- The patent discusses collapsing small coverage blocks (e.g., 100kbp) into larger blocks (~3Mbp) to reduce dimensionality but preserve spatial genomic structure, similar to Quant’s block collapsing approach.\n- Incorporation of normalization steps, including GC content correction, to improve coverage signal quality.\n- Artificial data augmentation strategies to enhance training datasets, including purity and ploidy adjustments, parallel data enhancement techniques applicable to Quant’s Bayesian integration framework.\n- Application for clinical decision making, such as predicting tumor response to therapies including PARP inhibitors, aligning with Quant’s variant prioritization for diagnostic and therapeutic decisions.\n- The patent’s machine learning model outputs HRD scores or CSI scores and associated binary or multi-class classifications (HRD+, HRD-, indeterminate), paralleling Quant’s Bayesian posterior probabilities with credible intervals.\n- The patent emphasizes low-coverage WGS combined with machine learning to identify chromosomal spatial instability, which conceptually overlaps with Quant’s genome-wide integration of observed and missing variant data to quantify diagnosis confidence.\n\n#### Key Differences\n\n- The patent focuses exclusively on detecting chromosomal spatial instability, specifically related to homologous recombination repair defects in tumor DNA, framed as a tumor genomics and oncology diagnostic tool.\n- Quant’s central innovation is quantifying prior probabilities of disease-causing variants genome-wide, across all genes and inheritance modes, integrating true and false calls (TP, FN, FP, TN) into a Bayesian posterior probability of complete genetic diagnosis.\n- The patent does not discuss evaluation or integration of variant-level prior probabilities from population allele frequencies or clinical variant classifications (e.g., gnomAD, ClinVar), nor does it address inheritance modes or rare disease gene panels.\n- Quant explicitly models false negative probabilities for missed rare variants in sequencing and integrates observed variant data within a Bayesian framework to assess diagnostic certainty. The patent focuses on coverage signal patterns and machine learning classification of chromosomal-level instability, without explicit Bayesian integration of variant detection uncertainties or mode of inheritance models.\n- The patent’s scoring is at a whole-sample HRD/CSI level, without per-variant or per-gene probabilistic outputs or credible intervals for variant pathogenicity or diagnosis confidence, which is a hallmark of Quant.\n- Quant’s methodology extends beyond oncology and somatic tumor samples, targeting germline variant interpretation and rare disease diagnostics; the patent centers on tumor samples and cancer treatment stratification.\n- The patent relies primarily on supervised and semi-supervised CNN classification of coverage signal images, whereas Quant integrates probabilistic prior-based modeling of variant observation and absence, which is mathematically distinct.\n- The patent does not explicitly mention or utilize TP, FN, FP, TN frameworks to estimate variant detection certainty or diagnosis probability.\n- Quant includes gene-level and variant-level integration using genetic inheritance models, which the patent does not address.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\nWhile the patent addresses a different clinical application domain (tumor genomics for HRD detection) and does not explicitly incorporate Quant’s unique Bayesian integration of prior variant probabilities with observed/missing variant data using TP and FN constructs, the technical approach of generating spatially arranged coverage signal arrays from low coverage WGS and classifying chromosomal instability via machine learning, including CNNs, bears conceptual similarity.\n\nBecause Quant’s unique novelty lies in Bayesian modeling of variant observation probabilities and diagnostic confidence intervals rather than solely machine learning classification of coverage patterns, the overlap is limited but present in the domain of low coverage WGS spatial data analysis and use of CNNs.\n\nClear distinctions exist in scope and technical specifics, but the use of related spatial coverage data structures and machine learning models for genome-wide inference suggests a meaningful technical intersection that warrants careful legal consideration to assess freedom to operate fully."]
  },
  "patent_EP3286677A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Device, system and method for assessing risk of variant-specific gene dysfunction\n- **Publication No.:** EP3286677A1\n- **Publication Date:** 2018-06-13\n- **Link:** https://patents.google.com/patent/EP3286677A1/en\n\n#### Abstract (excerpt)\n\n> \"A device, system and method for predicting gene-dysfunction caused by a genetic mutation in the genome of an organism. A neural network may comprise multiple nodes respectively associated with multiple different gene-dysfunction metrics and multiple different confidence weights. The neural network may combine the multiple gene-dysfunction metrics according to the respective associated confidence weights to generate one or more likelihoods that a genetic mutation causes gene-dysfunction in organisms.\"\n\n#### Relevant Overlaps\n\n- Use of a neural network combining multiple gene dysfunction components (metrics) weighted by confidence scores to estimate the likelihood that a variant causes gene dysfunction.\n- Incorporation of multiple gene-dysfunction metric categories, including population selection (homozygous effect, heterozygous effect, dominant effect), evolutionary selection (phylogenetic conservation), mutation class (mutation type), pathogenic predictors (such as PolyPhen-2, CADD, PROVEAN, VEST), and clinical classification.\n- Population-specific modeling of variant frequencies and selection pressures.\n- Use of evolutionary conservation and phylogenetic modeling to estimate variant deleteriousness.\n- Continuous scoring output reflecting likelihood of gene dysfunction rather than binary pathogenic/benign predictions.\n- Modeling of homozygous and heterozygous variant counts to assess recessive/dominant effects on disease risk.\n- Simulation of virtual progeny by combining parental haplotypes for pre-conception screening.\n- Training phase optimizing the neural network to distinguish known pathogenic, benign, and uncharacterized variants via cost function minimization, including bootstrap thresholds defining pathogenicity cutoffs.\n- Use of weighted aggregation and logistic transformations of predictive scores from established pathogenicity predictors.\n- Outputs include variant- and gene-level dysfunction likelihoods and credible intervals.\n\n#### Key Differences\n\n- The patent focuses mainly on predicting the likelihood that *individual variants* cause **gene dysfunction** or disease, using a composite score from variant-level metrics and population/evolutionary data.\n- The method does **not explicitly describe integration of patient-specific *observed vs. unobserved* variant data from a clinical genome** to derive a **posterior probability of a complete genetic diagnosis**, accounting for false negatives, which is central to Quant.\n- Quant uniquely models the **Bayesian posterior probability that a patient truly harbors a disease-causing variant**, integrating prior gene-level probabilities under Hardy-Weinberg equilibrium with patient-level variant calls, including possible false negatives (missing data).\n- The patent uses multiple data sources with a neural network to predict variant pathogenicity likelihood as a continuous score, but does not explicitly describe combining prior probabilities and patient evidence into a formal Bayesian framework to quantify diagnostic certainty with credible intervals.\n- Quant’s core innovation centers on genome-wide **prior probabilities of observing pathogenic variants**, mathematical integration of these priors with **patient-specific observed and missing data (TP, FP, TN, FN)**, and **computing diagnostic confidence intervals**.\n- The patent’s emphasis is on variant-centric gene dysfunction scoring and pre-conception carrier screening through simulation of progeny genetics, rather than full genome-wide **diagnostic certainty metrics** from patient data.\n- While the patent discusses simulation of virtual progeny for risk prediction, it lacks details about posterior probability modeling of patient diagnoses incorporating integration of observed vs. missing variant data.\n- The patent’s method applies a neural network for combining variant dysfunction metrics but does not appear to specifically model or output a Bayesian posterior probability reflecting diagnostic confidence accounting for unobserved variants.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThis patent describes a sophisticated system employing a neural network that integrates multiple gene dysfunction metrics, including population genetics, evolutionary conservation, pathogenicity predictors, and clinical classifications, to generate a continuous likelihood score for variant-specific gene dysfunction. This approach overlaps conceptually with aspects of Quant’s use of multiple data types for variant/disease prediction. However, Quant’s innovation lies significantly beyond variant dysfunction scoring, in its formal Bayesian integration of genome-wide prior probabilities with patient-specific observed and missing variant data to compute posterior probabilities of complete genetic diagnosis and convey credible intervals of diagnostic certainty — a unique clinical diagnostic certainty modeling not explicitly claimed here.\n\nBecause the patent’s core approach resembles variant-level gene dysfunction prediction combining population and evolutionary metrics with machine learning, and since Quant’s method relates closely to integrating prior variant observation probabilities under population genetics with patient genomic data, this may present FTO concerns. However, the described Bayesian posterior diagnostic confidence modeling incorporating false negative probabilities and clinical uncertainty is not expressly disclosed here, providing a technical distinction.\n\nGiven this very close resemblance to the combined use of population metrics and machine-learned integration of variant predictors, but lack of explicit account for patient observed/missing data and formal Bayesian diagnosis probability, the patent **represents potential overlap** with Quant’s technology and hence merits careful legal review.\n\n---\n\n*No other patents or publications were provided for analysis.*"]
  },
  "patent_EP3622068B1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods for determination of mutations in single replication events  \n- **Publication No.:** EP3622068B1  \n- **Publication Date:** 2019-03-06  \n- **Link:** https://patents.google.com/patent/EP3622068B1/en  \n\n#### Abstract (excerpt)\n\n> Abstract not provided; however, summary and description extensively discuss a method termed \"lineage sequencing\" for detection of somatic mutations by isolating single cells from a clonal population, sequencing them or their sub-clones, and reconstructing mutation flow with single-cell and single-generation resolution.\n\n#### Relevant Overlaps\n\n- The patent focuses on high-resolution, genome-wide detection of true somatic mutations using clonal lineages of cells tracked over generations, integrating multiple observations (multiple clones) to improve mutation call accuracy.  \n- Uses Bayesian/statistical modeling and lineage-informed joint variant calling to identify mutations observed in at least two related cells (similar to Quant’s use of TP, FN concepts).  \n- Provides mutation spectra and quantifies mutation rates across cell divisions.  \n- Enables estimation of false positive and false negative rates in calling mutations.  \n- Applies microfluidic devices, live cell imaging, optical tweezers, and laser microdissection for cell isolation and lineage tracking, combined with whole genome or exome sequencing.  \n- Discusses incorporation of true positive variant observation and accounting for leaf variants (potential false negatives) analogous to Quant’s approach of integrating observed/missing variant data.  \n- The method explicitly addresses single-cell resolution of mutation events, lineage structure analysis, and statistical inference of mutation likelihoods across genome-wide data.  \n- Employs rigorous statistical models (e.g., Poisson and Gamma distributions) for quantification of mutation rates and credible intervals, akin to Quant’s Bayesian posterior probabilities and credible intervals for diagnostic certainty.  \n- Claims cover methods of sequencing single cells or sub-clones from a clonal population, determining mutations by tracing their presence across lineages and generations, including detection of mutation signatures and rates, and handling perturbations (drugs, environmental conditions, gene modulation via CRISPR, etc.).  \n- Also describes bacterial lineage sequencing for mutations in single replication events with similar multi-generational, single-cell resolution.\n\n#### Key Differences\n\n- The patent is predominantly about somatic mutation detection in cellular lineages and bacterial populations, focusing on mutation discovery, lineage reconstruction, and mutation rate estimation in vitro or ex vivo cultures.  \n- Quant’s innovation centers on integrating prior probabilities of disease-causing variants (from population genetics/HWE assumptions and databases) with observed variant data from patients to compute Bayesian posterior probabilities of a **genetic diagnosis** incorporating false negative probabilities—i.e., focusing on clinical diagnostic certainty rather than mutation detection per se.  \n- Patent does not explicitly claim or describe methods for genome-wide **prior probabilities** of pathogenic variants, inheritance mode modeling, or integrating missing variant probability for diagnosis confidence; rather, it aims at sensitive and accurate mutation calling with lineage resolution.  \n- The Bayesian/statistical methods in the patent focus on mutation rate quantification and variant call confidence but do not resemble Quant’s core computational framework that combines prior pathogenicity with individual patient variant calls to generate diagnostic posterior probabilities.  \n- The patent addresses experimental and computational methods for mutation discovery with very high resolution, but does not address genome-wide prior probabilities for all pathogenic variant observation under Hardy-Weinberg Equilibrium or disease inheritance modes, or generation of credible intervals for a **complete genetic diagnosis** certainty.  \n- Uses terms like “lineage,” “true somatic mutations,” and “mutation signatures,” but does not develop a framework explicitly quantifying integration of observed true positives and false negatives at the variant or gene level for clinical diagnostic likelihoods.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThis patent shares significant technical overlap with Quant in terms of dealing with true positives, false negatives, Bayesian/statistical modeling, lineage-based mutation detection, and credible interval-based mutation rate estimation. Its claims on methods of mutation detection based on joint variant calling across multiple single-cell lineages and quantification of mutation certainty resonate with the core Quant concept of modeling TP, FN, TN, FP to derive posterior diagnostic probabilities.  \n\nHowever, the patent’s main focus and claimed scope relate to mutation detection and lineage analysis rather than clinical diagnosis probability computations integrating population prior probabilities and inheritance mode modeling. Quant’s core novelty is in deriving Bayesian posterior probabilities of complete genetic diagnosis confidence, explicitly incorporating prior pathogenic variant observation probabilities and diagnostic uncertainty—elements not evidently claimed or described in this reference.   \n\nGiven the conceptual closeness in handling true/false variant calls, statistical modeling of mutation probabilities, and use of lineage/clone data for calling mutations, there is a possible freedom-to-operate concern for Quant without proper legal review, particularly if Quant’s specific Bayesian prior-posteriors and diagnostic credible intervals rely on or could be interpreted to infringe the claimed methods here. \n\n---\n\n*No other patents/publications provided for analysis.*"]
  },
  "patent_EP4381512A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Somatic variant cooccurrence with abnormally methylated fragments\n- **Publication No.:** EP4381512A1\n- **Publication Date:** 2022-08-04 (priority), publication 2023-02-15\n- **Link:** https://patents.google.com/patent/EP4381512A1/en\n\n#### Abstract (excerpt)\n\n> \"Systems and methods for identifying variant alleles as somatic or germline are provided. Reference and variant alleles for a genomic position are identified. Methylation states and sequences of nucleic acid fragment sequences that map to the genomic position are obtained from a sample of a subject... One or more indications of the methylation states across the nucleic acid fragment sequences in the variant subset and an indication of the number of nucleic acid fragment sequences in the reference subset versus the variant subset are applied to a trained binary classifier. An identification of the variant allele at the genomic position as somatic or germline is obtained from the classifier.\"\n\n#### Relevant Overlaps\n\n- Both this patent and Quant analyze nucleic acid fragment sequences mapped to genomic positions.\n- Both assign fragment sequences to reference or variant subsets based on the allele they carry.\n- Both utilize methylation states of nucleotide fragments as features to inform classification.\n- Both apply a trained binary classifier to inputs comprising methylation metrics (e.g. p-values or methylation distributions) combined with counts or ratios of reference vs. variant fragments.\n- The patent details the use of distribution statistics of methylation p-values and CpG site counts aggregated over variant and reference subsets as model inputs.\n- Both focus on identification of variants as somatic or germline, integrating methylation and sequence data.\n- The classifier in the patent is trained on labeled data with known somatic/germline calls (orthogonal calls) analogous to supervised training described in Quant.\n- Both process millions of nucleic acid fragment sequences derived from biological samples such as liquid biopsies.\n- Employ Bayesian approaches for prior genotype probability in variant calling steps before allelic classification.\n- Use bisulfite or enzymatic conversion to detect methylated cytosines and derive methylation state vectors/patterns.\n- Using sample-specific methylation patterns relative to healthy cohorts (p-values) to identify anomalous methylation.\n- The patent explicitly incorporates assessment of variant allele counts, reference allele counts, methylation states, and CpG site features in a multivariate model.\n- Overall, the patent presents a method that very closely mirrors Quant’s approach of integrating allele-specific counts and methylation-based features processed through a classifier to classify variants as somatic or germline.\n\n#### Key Differences\n\n- The patent is specifically framed around calling somatic vs germline variants primarily leveraging co-occurrence with abnormal methylation fragments, possibly more focused towards cancer detection.\n- Quant’s core novelty lies beyond variant classification labels; it integrates prior probabilities and estimates false negatives to compute Bayesian posterior probabilities of *complete genetic diagnosis* with credible intervals—an emphasis on diagnostic confidence genome-wide.\n- Quant explicitly models genome-wide prior probabilities under Hardy-Weinberg equilibrium and integrates all observed and unobserved variant evidence into posterior probabilities of carrying a pathogenic variant causally linked to disease.\n- The patent focuses on classification of individual variant alleles as somatic or germline via methylation-aware supervised machine learning but does not disclose computation of gene-level or genome-wide prior and posterior probabilities of genetic diagnosis confidence.\n- Quant’s explicit inclusion of inheritance modes, false negative probabilities, and credible intervals for diagnostic certainty are not disclosed here.\n- This patent also includes extensive computational details on variant allele likelihood calculation using strand-specific base counts and bisulfite-conversion-aware Bayesian models absent in Quant.\n- Quant supports integration of many variant data types from bulk genome analyses, while the patent concentrates on methylation fragment co-occurrence signals for binary variant classification.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n### Summary\n\nThe patent EP4381512A1 discloses methods that are extremely close in technical approach to the key supervised classification aspect of Quant—i.e., assigning nucleic acid fragment sequences with reference and variant alleles, computing methylation metrics per subset, and passing those plus fragment counts to a trained binary classifier to distinguish somatic vs. germline variants. The extensive support for methylation p-values, CpG site counts, and Bayesian variant calling are highly aligned with Quant’s methylation-integrated variant classification.\n\nHowever, the patent does not disclose the core innovative framework of Quant that models genome-wide prior probabilities, incorporates false negative events for unobserved variants, calculates Bayesian posterior probabilities reflecting diagnostic confidence across all genes and inheritance modes, or produces credible intervals. Those broader diagnosis-confidence computations and genome-wide aggregation methods represent Quant’s unique technical contribution beyond the variant-level classification approach in this patent.\n\nGiven the high similarity in using methylation-aware classifiers to distinguish variant type but difference in the overall diagnostic probability framework and outputs, this patent presents potential freedom-to-operate concerns related to the variant-level somatic/germline classification step in Quant. A thorough legal review is recommended to carefully assess claims scope, possible workarounds, and licensing options relative to Quant’s variant classification components. The post-calling diagnostic confidence modeling and genome-wide probabilistic outputs of Quant appear not disclosed in this patent.\n\n---\n\n*End of Report*"]
  },
  "patent_JP2011530750A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method and system for personalized action plans\n- **Publication No.:** JP2011530750A\n- **Publication Date:** 2011-05-12 (actual publication date though filing may differ)\n- **Link:** https://patents.google.com/patent/JP2011530750A/en\n\n#### Abstract (excerpt)\n\n> \"The present disclosure provides a method and system for individual action planning based on an individual's genomic profile. The method includes assessing a relationship between an individual's genotype and at least one disease or condition and providing an assessment system for the individual's action plan.\"\n\n#### Relevant Overlaps\n\n- Both Quant and this patent analyze an individual's genomic profile to assess risk related to diseases.\n- The patent describes generating personalized phenotype profiles and action plans integrating genomic data.\n- The patent mentions using genotype-phenotype correlations and risk assessments such as Genetic Composite Index (GCI) or GCI Plus scores.\n- Use of public databases and genotype frequency statistics, statistical models to assess relative risks and produce risk scores related to diseases.\n- The patent also discloses generating an overall risk assessment or personalized action plan that includes recommendations on lifestyle, medical treatments, diet, exercise, etc.\n- The action plans are personalized using genotype-based risk scores and can include motivation/incentives to improve health.\n- Bayesian and statistical modeling of genotype-disease associations and calculation of relative risk or odds ratios is described.\n- Reporting of probabilistic risk estimates and credible intervals is consistent with Quant’s approach.\n- The patent extensively references use of true/false positives, relative risk (RR), odds ratios (OR), likelihood ratios, and quantitative risk modeling.\n- Recommendations are scored and presented with graded (color/number/letter) schemes, categorical groupings, and updateable reports.\n- Genomic profile acquisition via microarrays, PCR, sequencing, data storage, and digital processing pipelines are described similarly.\n\n#### Key Differences\n\n- This patent primarily focuses on generating personalized action plans and assessments for healthy lifestyle or disease risk reduction, incorporating genomic risk scores.\n- While many concepts overlap (use of GCI scores, genotype-disease risk probability, phenotype profiles), it emphasizes behavioral recommendations and motivating individuals with incentives.\n- Quant’s core novelty lies in Bayesian integration of prior probabilities of pathogenic variants, modeling true/false positives and negatives specifically to generate a **posterior probability of complete genetic diagnosis** with credible intervals, not only risk scoring or behavioral action plans.\n- Quant uniquely models uncertain or missing variant data (false negatives) and diagnostic confidence at the whole-genome level across inheritance modes, which is not explicitly claimed or discussed in this patent.\n- This patent describes relative risk and odds ratio calculations primarily associated with SNPs for risk prediction, rather than a general Bayesian framework that accounts for variant observation probabilities and diagnostic certainty.\n- While the patent uses GCI and GCI Plus scores, it appears more oriented toward risk prediction and personalized lifestyle/medical recommendations, rather than the diagnostic certainty quantification that distinguishes Quant.\n- No explicit mention or claim of integrating true positive, false negative probabilities at variant/gene/patient level to compute a posterior probability of a complete molecular diagnosis.\n- No detailed disclosure concerning credible intervals for uncertainty quantification analogous to Quant’s unique feature.\n- The patent’s focus is broader lifestyle and health motivation, not freedom-to-operate for the specific Bayesian diagnosis confidence framework of Quant.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis Japanese patent significantly overlaps with Quant in usage of genomic profiles for risk scoring, phenotypic profiling, use of GCI/GCI Plus, and personalized action plans. However, it does not clearly teach or claim the unique Bayesian modeling of true positives, false negatives, and posterior probabilities of complete genetic diagnosis, which is Quant’s core novelty. The risk scoring and behavioral recommendation focus differs from Quant’s diagnostic probability framework. Due to strong technical resemblance in variant scoring, disease risk assessment, and personalized recommendations, the patent may pose potential FTO issues, meriting further legal review."]
  },
  "patent_JP2020524350A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Interpretation of gene and genomic variants via integrated computing and experimental deep mutation learning frameworks\n- **Publication No.:** JP2020524350A\n- **Publication Date:** 2020-03-26\n- **Link:** https://patents.google.com/patent/JP2020524350A/en\n\n#### Abstract (excerpt)\n\n> \"Disclosed herein are embodiments of systems, methods, and computer program products for determining the phenotypic effects of identified molecular variants in a biological sample. Embodiments include receiving a molecular variant associated with a functional element within the model system. Embodiments then determine a molecular score associated with the model system... Embodiments then determine the phenotypic effect of the molecular variant based on the functional score or evidence score.\"\n\n#### Relevant Overlaps\n\n- Both the patent and Quant focus on modeling and classifying molecular variants with respect to their phenotypic effects.\n- Use of statistical/machine learning techniques to derive functional scores and classifications from molecular data.\n- The patent describes multi-dimensional modeling of large-scale variant functional effects, including the use of single cell data, molecular and phenotypic signals, and leveraging information across multiple genes and pathways.\n- The patent integrates molecular measurements, both observed and inferred functional impacts, to generate functional scores, evidence scores, variant classification, and phenotype prediction - similar high-level goals to Quant’s Bayesian posterior probability estimation of genetic diagnosis confidence.\n- Incorporation of large-scale variant datasets, population frequencies, and functional annotations, overlapping with Quant’s usage of gnomAD, ClinVar, and other public data.\n- Use of machine learning architectures such as neural networks and autoencoders to improve the accuracy of variant effect prediction.\n- Consideration of false negatives, variant observation probabilities and codifying uncertainty, which echoes Quant’s unique modeling of false negative probabilities to derive diagnostic credible intervals.\n- Description of multi-level statistical learning from variant-level molecular signals up to gene and pathway-level models, aligning with Quant's genome-wide prior probability framework.\n- Use of variant effect predictors and integrated experimental deep mutation learning (DML) frameworks to better model variant pathogenicity.\n- The patent explicitly claims probabilistic inference linking variant molecular signals to phenotypic effects.\n\n#### Key Differences\n\n- The patent focuses heavily on experimental and computational infrastructure for deep mutation learning using large scale functional assays and single cell molecular measurements, emphasizing training classifiers from these.\n- Quant’s distinct novelty is in explicitly modeling prior probabilities of variant pathogenicity genome-wide, integrating these priors with observed and unobserved variant data from an individual, to compute Bayesian posterior probabilities of a complete genetic diagnosis including false negatives.\n- The patent does not discuss the concept of integrating prior pathogenicity probabilities with false negative assessment in clinical sequencing data to obtain diagnostic credible intervals or posterior confidence.\n- Quant’s approach is tailored to clinical diagnostic certainty quantification rather than only variant classification or prediction.\n- No explicit mention in the patent of modeling Hardy-Weinberg equilibrium-based variant occurrence priors or providing credible intervals reflecting diagnostic certainty as in Quant.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**\n\nWhile the patent broadly covers systems and methods for molecular variant phenotypic effect classification using deep mutation learning, neural networks, single cell data, and multiparameter statistical models, its focus is on prediction of variant pathogenicity from molecular/functional experimental data. Quant’s distinctive inventive concept is the integration of genome-wide prior probabilities with patient-observed and missing variant data (including explicit false negative modeling) to yield Bayesian posterior probabilities of genetic diagnosis confidence, a higher-level inference rarely addressed in prior art.\n\nDue to the significant conceptual similarity in variant effect prediction and classification, but with clear key differences in purpose, data integration, and modeling approach (especially around clinical diagnostic certainty quantification via Bayesian posterior), this patent represents a relevant but not necessarily blocking reference.\n\n---\n\n# Short Notes\n\n- The patent presents a complex method of using experimental deep mutation scanning data, molecular and population signals, and multi-level modeling (autoencoders, neural networks), also considering variant effects and functional scores.\n- Quant emphasizes generating variant and gene-level genome-wide prior probabilities, integrates those with observed/missing patient variants, explicitly models false negatives, and outputs a credible interval Bayesian posterior probability of a genetic diagnosis.\n- Overlap centers on machine learning variant classification; key difference is diagnostic confidence inference with false negative modeling in Quant.\n- The patent documents integration of functional and phenotypic molecular data but stops short of clinical diagnostic posterior probability estimation.\n\n---\n\nIf additional patents or publications are provided, further analyses can be conducted following this template."]
  },
  "patent_JP2023505031A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods and compositions for cancer analysis  \n- **Publication No.:** JP2023505031A  \n- **Publication Date:** 2023-03-02  \n- **Link:** https://patents.google.com/patent/JP2023505031A/en  \n\n#### Abstract (excerpt)\n\n> \"Combined, ultrasensitive sequencing of corresponding leukocyte and cell-free DNA (cfDNA) identified true tumor-specific alterations predictive of clinical outcome after preoperative treatment and resection.\"\n\n#### Relevant Overlaps\n\n- Uses ultrasensitive sequencing of matched cfDNA and leukocyte DNA to detect tumor-specific mutations in multiple cancers (gastric, colorectal, lung, esophageal).\n- Specifically distinguishes tumor-derived mutations from hematopoietic (clonal hematopoiesis, CH) or germline mutations by comparative sequencing of leukocytes and cfDNA.\n- Utilizes high-depth next-generation sequencing with error correction and statistical (Bayesian) models to remove false positives.\n- Detects and quantifies variant allele fractions, correlates ctDNA levels longitudinally to clinical outcomes like pathological response, disease recurrence, progression-free and overall survival.\n- Applies to cancer types including gastric, colorectal, lung, and esophageal cancers, as well as various clinical stages and perioperative settings.\n- Emphasizes detection of minimal residual disease (MRD) after surgery by ctDNA.\n- Uses Bayesian modeling or probabilistic approaches to classify variants as tumor- or hematopoietic-derived based on variant allele fraction and occurrence in leukocyte sequencing.\n- Incorporates paired-end sequencing, error filters, pathogenetic variant databases (e.g., COSMIC), and clinical outcome correlations.\n- Provides solid evidence for monitoring treatment response, recurrence risk stratification, and patient selection for adjuvant/neoadjuvant therapies based on ctDNA dynamics.\n- Includes detailed clinical trial analyses, including CRITICS trial (gastric cancer), colorectal cancer cohort, and immunotherapy-treated lung and esophageal cancer patients.\n- Uses multiple time-point plasma samples and matched leukocyte DNA to achieve accurate detection of tumor-specific mutations.\n- Identifies clonal hematopoiesis related variants and excludes them to improve specificity of ctDNA assays.\n- Describes use of extensive public datasets (gnomAD, ClinVar, COSMIC) and integrates bioinformatics pipelines.\n\n#### Key Differences\n\n- Quant’s unique innovation lies specifically in integrating prior variant observation probabilities genome-wide under Hardy-Weinberg equilibrium and modeling false negatives to compute Bayesian posterior probabilities of a **complete genetic diagnosis confidence**, not merely identifying and quantifying tumor-specific mutations.\n- This patent focuses on **detection and monitoring** of circulating tumor DNA mutations and discriminating tumor versus CH variants—but does not address:\n  - Genome-wide prior probability modeling of pathogenic variants.\n  - Quantifying probability of a complete genetic diagnosis from combined observed and missing variant data.\n  - Modeling false negatives in sequencing coverage or variant detection.\n  - Explicit credible intervals on diagnostic certainty in a Bayesian framework.\n- The metastatic cancer and liquid biopsy context emphasizes tumor burden monitoring and molecular response, distinct from Quant’s rare disease genome-wide diagnostic probability modeling.\n- Use of conventional deep sequencing and variant calling with filtering of CH variants is a known approach, whereas Quant claims novel Bayesian integration of prior probabilities and inheritance mode modeling.\n- The patent primarily applies to somatic variant detection from plasma and WBC DNA in solid tumors, rather than germline variant diagnosis confidence quantification across genomes.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\nThe methods of this patent and Quant both:\n\n- Use matched leukocyte and cfDNA sequencing to distinguish tumor-derived from CH-derived variants.\n- Employ deep sequencing, variant filtering, and Bayesian/statistical modeling.\n\nHowever, the patent focuses on somatic variant detection and disease monitoring, while Quant’s patented innovation centers on genome-wide Bayesian prior probability modeling for diagnostic confidence of rare germline variants, integrating false negatives, multiple inheritance modes, and producing credible intervals.\n\nBecause this patent closely relates to use of matched leukocyte and cfDNA sequencing data, Bayesian filtering of variants, and clinical outcome monitoring, **there is potential overlap with Quant’s approach**, particularly if Quant’s claims or freedom-to-operate scope includes such matched leukocyte-cfDNA analysis and Bayesian variant classification methods.\n\n---\n\n# Summary\n\nThis patent discloses a technology for:\n\n- Detecting tumor-specific mutations in cfDNA by high-depth paired sequencing of plasma and leukocytes.\n- Filtering or excluding hematopoietic-origin variants to improve specificity.\n- Monitoring molecular response and MRD in various cancers.\n- Using Bayesian statistical models to estimate tumor origin of variants absent from matched leukocyte sequencing.\n- Clinical correlations to predict outcomes based on ctDNA dynamics.\n\nThis overlaps with core technical concepts in Quant involving Bayesian differentiation of variant origin using leukocyte data and cfDNA, though it does not emphasize Quant’s unique innovation of genome-wide prior probability integration and diagnostic certainty quantification.\n\nGiven the close technical resemblance in the leukocyte-guided Bayesian filtering concept, an FTO legal review is warranted."]
  },
  "patent_JP2023505363A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Whole Genome Sequencing Method for Picogram Quantities of DNA\n- **Publication No.:** JP2023505363A\n- **Publication Date:** 2023-03-02\n- **Link:** https://patents.google.com/patent/JP2023505363A/en\n\n#### Abstract (excerpt)\n\n> \"The present invention relates to a method for whole genome sequencing of a single cell or group of cells for identifying single nucleotide variants, identifying structural chromosomal alterations, or identifying phasing information in the genome of a single cell or group of cells... Advantageously, the present invention provides an index for obtaining high-quality, data-rich sequencing results from picogram amounts of DNA obtained from clinical samples by means of the single DNA molecule sequencing approach herein.\"\n\n#### Relevant Overlaps\n\n- The patent describes a whole genome sequencing (WGS) approach for single cells or small cell groups involving distribution of genomic DNA into multiple wells, whole genome amplification (WGA), adapter ligation with unique indexing per well (row and column indices), and subsequent sequencing.\n- It specifically addresses identification of single nucleotide variants (SNVs), structural chromosomal changes, and phasing information in single or grouped cells.\n- The method partitions single-stranded genomic DNA molecules into distinct reaction wells to enable discrimination of true variants from amplification-induced artifact mutations.\n- The patent further applies Bayesian/artificial neural network (ANN) models to analyze variant calls and remove false positives, enhancing sensitivity for true positive somatic variants.\n- The use of two-dimensional indices (row and column) and paired indices at both fragment ends to reduce index cross-contamination parallels the described Quant innovation on indexing redundancy to remove contamination.\n- The data inputs, processing steps (partitioning, WGA, indexing, PCR amplification, sequencing, variant calling, filtering, ANN-based classification), and outputs (high-confidence variant calls, credible interval quantification) strongly mirror the technical concept of integrating observed and unobserved variant data to improve variant diagnosis certainty.\n\n#### Key Differences\n\n- The patent focuses on single-cell or small-cell group sequencing primarily for mutation discovery and phasing, with substantial emphasis on laboratory methods for library construction, fragment indexing, and error filtering.\n- While Bayesian and ANN models for false positive removal are mentioned, the patent does not elaborate or claim the specific innovation of genome-wide prior probability integration under Hardy-Weinberg equilibrium used by Quant.\n- Quant uniquely claims integration of prior variant pathogenicity probabilities with observed/missing data to derive posterior diagnostic certainty including false negative modeling, which is not clearly described or claimed here.\n- The patent’s indexing and sequencing improvements serve mainly to produce higher quality sequencing data and remove artifacts but do not explicitly quantify confidence of a complete genetic diagnosis or provide credible intervals for diagnosis as in Quant.\n- Public databases like gnomAD, ClinVar, and complex disease gene models used in Quant are not emphasized or claimed in this patent.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThis patent discloses a sequencing method with many technical elements very similar to Quant’s approach: partitioning single DNA molecules into wells; indexing with redundant row and column indices; use of WGA; filtering false positives by ANN models; generating high-confidence variant calls from limited picogram DNA inputs. These core aspects resonate strongly with Quant’s innovation in integrating observed variant calls and probabilistic models for diagnostic certainty. However, the patent lacks explicit treatment or claims of Quant’s unique Bayesian integration of prior variant observation probabilities and false negative modeling for complete diagnostic confidence.\n\n---"]
  },
  "patent_JP2025514547A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods and devices for parental origin disease allele detection for the diagnosis and management of genetic diseases\n- **Publication No.:** JP2025514547A\n- **Publication Date:** 2023-03-02\n- **Link:** https://patents.google.com/patent/JP2025514547A/en\n\n#### Abstract (excerpt)\n\n> \"A method for assigning uniparental origin to haplotypes, subhaplotypes, or alleles associated with haplotypes, wherein chromosome-length haplotypes of a genome are generated and a methylation variable status of at least one imprinted methylation variable region (iDMR) is determined, and the iDMR methylation variable status is used to assign uniparental origin for each chromosome-length haplotype.\"\n\n#### Relevant Overlaps\n\n- Both Quant and this patent focus on genetic variant analysis and leverage genomic haplotype data.\n- This patent specifically generates chromosome-length haplotypes and assigns parental origin by integrating methylation information from iDMRs.\n- It uses long-range phasing data (e.g., Strand-seq and nanopore sequencing) combined with methylation data to assign uniparental origin (PofO) of haplotypes.\n- The approach includes phasing observed variants and integrating methylation-based epigenetic data to infer the parental origin of each homologous chromosome.\n- The patent also claims determination of PofO without requiring parental DNA data.\n- Quant's innovation involves using prior probabilities, observed variant calls including false negatives, and Bayesian posterior probability to quantify diagnostic confidence genome-wide.\n- Both systems utilize Bayesian or probabilistic frameworks, but Quant uniquely integrates prior probabilities with observed/missing data (TP, FN, FP, TN) for comprehensive diagnostic certainty, rather than just PofO determination or phasing.\n- The patent describes applications in clinical diagnosis, variant curation, cancer risk management, and cascade genetic testing facilitation, similar to Quant’s intended use.\n\n#### Key Differences\n\n- The patent focuses on epigenetic-based parental origin assignment using imprinted methylation patterns and long-range phasing information.\n- Quant is differentiated by explicitly modeling prior probabilities of pathogenic variants based on population data and observed variant evidence, including false negatives, to calculate a Bayesian posterior probability of a complete genetic diagnosis.\n- Quant does not primarily claim or emphasize haplotype phasing or parental origin determination via methylation or epigenetics.\n- The patent’s method centers on structural haplotype construction and parent-of-origin assignment, not on estimating the probability of disease causality integrating TP, FN, FP, TN variant observations.\n- Quant’s innovation lies in quantifying genome-wide prior and posterior probabilities, providing diagnostic credible intervals—features not claimed or described in this patent.\n- The patent does not describe handling false negative probabilities or modeling diagnostic confidence in Bayesian terms for complete genetic diagnoses, which are core to Quant.\n- Use of TP, FN counts or Bayesian posterior probability of diagnosis from variant observation patterns is not disclosed.\n- The patent relies on experimental methods (e.g., nanopore methylation sequencing, Strand-seq) to assign parental origin; Quant is primarily a computational framework integrating data sources and probabilistic modeling for diagnosis confidence.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThis patent discloses a method using haplotype phasing and imprinted methylation (iDMRs) to assign parental origin of haplotypes in human genomes, which shows technical resemblance to part of Quant’s theory of integrating haplotype and methylation data for parental origin assignment. However, Quant’s core novelty lies beyond parental origin assignment—specifically in leveraging variant-level prior probabilities, observed and missing variant calls, and explicitly modeling true and false positives/negatives to derive Bayesian posterior probabilities quantifying the confidence of a genetic diagnosis. The patent does not appear to disclose or claim the key Quant innovations around integrating prior probabilities and variant detection errors (TP, FN) to compute posterior diagnostic probabilities. Nonetheless, because both involve Bayesian interpretations of variant data and epigenetic information in clinical genetic diagnostic contexts, there is potential overlap that warrants detailed legal evaluation to clear freedom to operate."]
  },
  "patent_JP6328934B2": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** 非侵襲性出生前親子鑑定法 (Noninvasive prenatal testing)\n- **Publication No.:** JP6328934B2\n- **Publication Date:** [Not Available]\n- **Link:** https://patents.google.com/patent/JP6328934B2/en\n\n#### Abstract (excerpt)\n\n> \"Disclosed herein is a method for determining paternity of a fetus that is conceived in a non-invasive manner. The method obtains genotype measurements at multiple polymorphic loci for genetic material derived from a pseudofather, maternal genetic material, and a mixed sample of fetal and maternal DNA from maternal blood, and determines by computer the probability that the pseudofather is the actual father of the fetus.\"\n\n#### Relevant Overlaps\n\n- Bayesian statistical modeling integrating prior allele frequencies with observed maternal plasma mixed fetal-maternal DNA data.\n- Use of polymorphic loci (primarily SNPs) across the genome.\n- Computation of a test statistic reflecting genetic similarity between putative father and fetus.\n- Consideration of both observed data and potential false negatives (e.g., allele drop-out).\n- Use of prior population allele frequencies (e.g., HapMap or gnomAD) in statistical analysis.\n- Estimation of fetal fraction (fetal DNA proportion) in maternal plasma, including partitions over possible values.\n- Calculation of posterior probability (using maximum likelihood or maximum a posteriori methods) that the alleged father is the true biological father.\n- Incorporation of false positive/negative rates and generation of paternity inclusion or exclusion calls with associated confidence intervals.\n- Modeling of haplotypes and parental phasing to enhance determination accuracy.\n- Sequencing or SNP array-based genotyping of maternal, paternal, and mixed samples.\n- Handling of low fetal fraction and noisy sequencing data with probabilistic modeling.\n- Integration of possible false negatives (e.g., in missing variant detection) in Bayesian framework.\n- Reports summarizing likelihood of paternity and confidence scores.\n- Non-invasive sample types including maternal plasma cfDNA and isolated single fetal cells.\n\n#### Key Differences\n\n- The patent focuses specifically on non-invasive prenatal paternity testing (NIPPT) via analysis of maternal plasma cfDNA or isolated fetal cells. The primary goal is paternity determination.\n- The method models genetic similarity at polymorphic loci to compute probability of paternal relationship but does not describe or claim genome-wide estimation of prior probabilities for **disease-causing variants** or Bayesian posterior probability of a **genetic diagnosis**.\n- The patent does not address the systemic genome-wide modeling of variant pathogenicity priors under Hardy-Weinberg Equilibrium integrating observed/missing variant data (TP, FN etc) for rare disease diagnosis.\n- The methodology focuses on allele frequency modeling for paternity inference, not on estimating the probability of observing pathogenic alleles across genes with regard to different modes of inheritance or quantifying diagnostic certainty with credible intervals.\n- The math is applied towards paternity likelihood ratio tests, whereas Quant’s novelty is in combining prior pathogenic variant probabilities with patient-specific variant evidence (including false negative models) to estimate diagnostic confidence.\n- The patent does not address credible intervals or uncertainty quantification explicitly for genetic diagnoses.\n- The patent also lacks explicit modeling for false negatives in variant detection genome-wide for disease diagnosis, focusing instead on genotyping known polymorphisms informative for parentage.\n- This patent is centered around statistical methods specific to prenatal paternity testing, not about genome-wide variant pathogenicity estimation or disease genetic diagnosis.\n- Overlap is in using Bayesian approaches and population allele frequencies but applied in a different clinical context with a different problem and data type focus.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Rationale:**  \nThis patent discloses comprehensive Bayesian frameworks for non-invasive prenatal paternity determination by integrating paternal, maternal, and mixed fetal-maternal genotype data. It uses population allele frequencies and probabilistic models to calculate posterior probabilities of paternity inclusion or exclusion, managing data noise, fetal fraction estimation, and single-cell or cfDNA samples. These aspects superficially resemble Bayesian methods integrating prior probabilities with observed data.\n\nHowever, Quant's core innovation lies specifically in modeling genome-wide prior probabilities of **disease-causing variants** and integrating these with observed and expected false variant calls, across different inheritance modes to compute Bayesian posterior probabilities of a **complete genetic diagnosis**. This entails a fundamental difference in objective, calculations, and technical focus.\n\nNotwithstanding, because both involve Bayesian integration of prior genetic probabilities and observed genetic data from patients, and both explicitly compute posterior probabilities reflecting biological relationship (paternity vs diagnostic certainty), the overlap in theory and probabilistic infrastructure is significant enough to warrant a detailed legal review.\n\nNo documentation in the patent addresses quantification of genetic diagnosis confidence intervals from whole-genome variant data including TP/FN/FP/TN categorization used by Quant. Instead, it focuses on parental testing via polymorphic loci.\n\nThe large array of similar dataset usage (gnomAD, HapMap, SNP arrays) and statistical frameworks suggest the closest potential blocking overlap found.\n\n---\n\n*No other specific patents or publications were provided for review.*"]
  },
  "patent_JP7634626B2": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method for detecting genetic variations in highly homologous sequences by independent alignment and pairing of sequence reads - Patents.com\n- **Publication No.:** JP7634626B2\n- **Publication Date:** 2020-05-25 (priority from 2018)\n- **Link:** https://patents.google.com/patent/JP7634626B2/en\n\n#### Abstract (excerpt)\n\n> [0002] \"The following disclosure relates generally to determining genetic variation, and more particularly to determining genetic variation in highly homologous regions of interest in a genome, e.g., in genomic regions that include genes and pseudogenes.\"\n\n> [0009], [0011], [0012], [0014]: Method for detecting genetic variations in a genome comprising highly homologous first and second regions by paired-end sequencing, separately aligning first and second reads to a reference genome, identifying reads aligned to the first region, pairing reads to generate top paired alignments, and detecting genetic variations in these alignments. The method uses Burrows-Wheeler Aligner (BWA), with specific pairing criteria based on alignment scores and template length.\n\n#### Relevant Overlaps\n\n- The patent discloses methods directed to detection of genetic variations in highly homologous genomic regions (genes and pseudogenes), by sequencing paired-end reads and separately aligning each read to a reference genome.\n- It involves generating multiple possible alignments per read and selecting top alignments, then pairing the reads to form \"top pair alignments\" used for variant detection.\n- It explicitly addresses the problem of ambiguous alignment in highly homologous regions, e.g., PMS2/PMS2CL.\n- The methods include detecting SNVs, indels, inversions, and CNVs, and use BWA and HMM callers for copy number variant detection.\n- The patent discusses addressing ambiguous sequence regions, special mapping strategies to distinguish gene and pseudogene-derived sequences, and reflex workflows for variant disambiguation via LR-PCR and MLPA following initial NGS.\n- Variant calling uses allele dosage up to tetraploid to model combined gene/pseudogene signals.\n- Also includes simulation of CNVs, testing performance sensitivity and specificity akin to the example data shown.\n- The detailed methods and example workflows mirror the technology description’s approach to:\n\n  - Paired-end read independent alignment in homologous regions\n  - Ambiguous alignment resolution by pairing reads post single-end alignment\n  - Use of tetraploid-aware variant calling for combined gene/pseudogene regions\n  - Reflex strategies employing LR-PCR and MLPA to confirm variant origin\n  - Quantitative CNV detection using HMM-based callers with adjusted ploidy\n  - Analysis focused on PMS2/PMS2CL loci, emphasizing the challenges of homologous regions\n\n#### Key Differences\n\n- The patent focuses on the technical methods for read alignment and variant detection in homologous regions at the NGS data processing level.\n- The disclosed method aims to improve accuracy in variant calling by better handling ambiguous reads through paired-end independent alignment and scoring.\n- It does not describe nor claim the Bayesian integration of prior probabilities with observed variant data to quantify the posterior probability of a complete genetic diagnosis, or the explicit integration of false negative probability modeling.\n- The patent lacks any discussion or claims on a genome-wide prior probabilistic framework that integrates population-level variant data, inheritance mode effects, and produces credible intervals for diagnosis certainty.\n- Quant's novelty lies in genome-wide variant probability modelling and uncertainty quantification for diagnostic confidence, rather than solely on read alignment and variant calling methods focused on difficult homologous regions.\n- Commonly referenced tools and datasets (gnomAD, ClinVar, PanelApp) appear generally but the patent does not discuss prior/posterior probability calculations or integrate TP/FN like Quant.\n- The patent concerns mainly detection, alignment, and initial calling accuracy improvements, not the formal probabilistic quantification of diagnostic certainty.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Note:** The patent and the described Quant technology share substantive similarity in their approach to variant detection in highly homologous genomic regions such as PMS2/PMS2CL, including paired-end read independent alignment, ambiguous read resolution, and reflex testing workflows. However, the patent focuses on the computational and algorithmic methods of alignment and variant calling, while Quant’s key innovation centers on the Bayesian integration of prior probabilities with observed/missing variant data to quantify diagnostic confidence genome-wide. Since the claims encompass methods very close to the alignment, pairing, and variant calling approach employed by Quant at the technical level, there is potential for overlap, especially if Quant’s methods implement similar pairing and alignment strategies foundational to subsequent Bayesian analyses. The distinction lies in Quant’s unique probabilistic modelling layer beyond variant detection.\n\nNo other provided patents or publications were given for analysis. If additional references are provided, further sections can be generated accordingly."]
  },
  "patent_KR20220157976A": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Analysis method of cell-free nucleic acid and its application\n- **Publication No.:** KR20220157976A\n- **Publication Date:** 2022-03-02\n- **Link:** https://patents.google.com/patent/KR20220157976A/en\n\n#### Abstract (excerpt)\n\n> \"Processes and materials for detecting neoplasms from biopsies are described. Processes and materials for constructing sequencing libraries are described... Cell-free nucleic acids can be sequenced and the sequencing results can be used to detect sequences derived from neoplasia.\"\n\n#### Relevant Overlaps\n\n- Use of Bayesian computational models integrating cfDNA and cellular DNA (e.g. WBC) sequencing data to detect neoplasms by identifying tumor-derived nucleic acid variants (both SNVs and CNVs).\n- Incorporation of variant-level features such as VAF, fragment size, genomic location, mutational signatures, and clonal hematopoiesis (CH) filtering.\n- Estimating probability/confidence scores for presence of neoplasia from sequencing data.\n- Correction for false positives caused by clonal hematopoiesis and introduction of unique molecular identifiers (UIDs) and dual index barcodes to reduce sequencing errors.\n- Use of in silico simulations to optimize sequencing workflows and molecular recovery.\n- Adjustment of allele fractions based on tumor purity, CNV state, and clonality.\n- Multimodal models combining SNV, CNV, and fragmentomic features in a machine learning classification framework.\n- Clinical applications including early cancer detection, residual disease monitoring, and treatment decision guidance based on reported confidence intervals and risk scores.\n- Methods for constructing sequencing libraries with error-correcting molecular barcodes, hybrid capture with optimized bait sets, and mitigation of oxidative DNA damage (e.g. use of hypotaurine).\n\n#### Key Differences\n\n- Quant’s unique novelty focuses strongly on calculating genome-wide prior probabilities (under Hardy-Weinberg equilibrium) of pathogenic variant observation and integrating observed/missing variant data into a Bayesian posterior probability of a complete genetic diagnosis, explicitly modeling false negatives and reporting credible intervals of diagnostic certainty.  \n- The present patent emphasizes detection of tumor-derived cfDNA in oncology, integrating sequencing data for neoplasm detection and clinical intervention. It broadly addresses Bayesian modeling for cfDNA mutation classification, clonal hematopoiesis filtering, and technical improvements to sequencing and variant calling, but there is no explicit disclosure or claim of genome-wide prior probability modeling or integration of inheritance modes as done in Quant.  \n- Though Bayesian models are used, these focus on classification of variants as tumor-derived vs. background and cancer detection, rather than providing a prior probability baseline leveraging population genetics assumptions as in Quant.  \n- The purpose is neoplasm detection from cell-free nucleic acids (liquid biopsy), not genome-wide quantification of disease-causing variant probabilities and diagnostic completeness certainty.  \n- The document does not describe explicitly the mathematical framework of combining TP, FP, TN, FN with prior probabilities across modes of inheritance to generate a posterior credible interval of genetic diagnosis as Quant does.  \n- The data inputs, while overlapping (gnomAD, ClinVar etc), are used differently with focus on cancer-specific mutation detection rather than genome-wide variant pathogenicity confidence scoring covering all human genes and diseases.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThe provided patent describes comprehensive methods and systems to detect neoplasm-derived circulating tumor DNA via advanced Bayesian models integrating observed variant calls, accounting for error modes, clonal hematopoiesis, and providing confidence scores for diagnosis. It shares some technical concepts with Quant, such as Bayesian modeling, variant-level feature integration, use of public databases, and technical sequencing enhancements. However, the patent primarily focuses on oncology (ctDNA detection) and does not detail the unique Quant innovation of calculating genome-wide priors under genetic equilibrium, integrating false negative probabilities, and deriving Bayesian posterior probabilities quantifying the certainty of a complete genetic diagnosis across all human disease genes and modes of inheritance. While overlapping in general approach and datasets, the core theoretical framework of Quant is more specialized and focused on prior probability modeling unique to rare inherited disease diagnosis rather than cancer variant detection workflows. Given the overall similarity in type of data and Bayesian approach but substantial difference in core theoretical framework and application domain, there is potential overlap requiring legal review."]
  },
  "patent_NZ759848B2": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods and Systems for Accurate Computational Decomposition of DNA Mixtures from Contributors of Unknown Genotypes\n- **Publication No.:** NZ759848B2\n- **Publication Date:** Not explicitly provided (filed June 20, 2017 provisional priority)\n- **Link:** https://patents.google.com/patent/NZ759848B2/en\n\n#### Abstract (excerpt)\n\n> \"Some implementations provide computer-implemented methods and systems for quantification and deconvolution of nucleic acid mixture samples including nucleic acid (e.g., DNA or RNA) of two or more contributors having unknown genotypes...Because various methods and systems provided herein implement strategies and processes that use probabilistic mixture models and Bayesian inference techniques, the embodiments provide technological improvements over conventional methods in quantification and deconvolution of nucleic acid (e.g., DNA or RNA) mixture samples.\"\n\n#### Relevant Overlaps\n\n- Both Quant and this patent address quantification of DNA mixtures from multiple contributors using probabilistic models.\n- Use of Bayesian inference techniques to estimate contributor fractions in a nucleic acid mixture.\n- Account for errors in sequencing reads and sample preparation (extraction, PCR amplification), employing beta-binomial models to capture variability beyond simple binomial sampling.\n- Modeling genotypes as unknown or partially known, marginalizing over possible genotype combinations, with priors based on population allele frequencies, including Hardy-Weinberg equilibrium.\n- Incorporation of sequencing error rates (λ) into expected allele frequency calculations.\n- Use of multi-locus likelihood functions combining single-locus likelihoods.\n- Use of numerical optimization methods combining grid search and quasi-Newton methods (BFGS) for maximum likelihood estimation of mixture fractions.\n- Capability to provide confidence intervals for estimated fractions via Hessian matrix of log-likelihood.\n- Handling mixtures of up to multiple contributors (including >2), with unknown genotypes.\n- Specific methods for unbiased mapping of reads to reference genome via hashing and generation of unbiased target sequences to mitigate mapping bias at polymorphic sites.\n- Modeling multiple experimental steps probabilistically: DNA extraction, amplification, and sequencing.\n- Application to clinical use cases including transplants (donor and donee mixture).\n- Providing quantitative measures of fractional DNA contribution, not just classification.\n  \n#### Key Differences\n\n- The patent focuses on quantifying relative DNA fractions of contributors in a nucleic acid mixture and deconvolution of mixture samples, whereas Quant focuses on genome-wide **prior** and **posterior** probabilities related to **disease-causing variants** and diagnostic confidence.\n- Quant’s key novelty is integrating prior probabilities of pathogenic variant observation with true positives and false negatives to derive Bayesian diagnostic posterior probabilities with credible intervals related to genetic diagnosis certainty.\n- The patent does not discuss genomic disease diagnosis or variant pathogenicity prior probabilities, modes of inheritance, or credible intervals for a **genetic diagnosis**; rather, it focuses on estimating contributor fractions (e.g., donor versus recipient DNA) in mixtures such as chimerism testing.\n- The patent models allele frequencies and sequencing errors to estimate fractional contributions of contributors, not probabilistic diagnosis of disease variants.\n- Quant’s integration of variant-level prior pathogenicity probabilities with observed/missing variant data across the whole genome is conceptually distinct from estimating donor fractions in mixture samples.\n- Quant explicitly incorporates gene and disease panel data (PanelApp), inheritance modes, and public pathogenicity databases (ClinVar, AlphaMissense) for variant diagnosis probability estimation.\n- The patent’s examples and claims focus on polymorphism loci allele counts for **mixing fraction estimation**; Quant focuses on prior and posterior probabilities for presence/absence of **pathogenic genotypes**.\n- Quant provides **genome-wide** integration with credible intervals specifically for genetic diagnosis confidence, whereas this patent is tailored for mixture decomposition (e.g., chimerism) with no claim to diagnosis confidence or variant pathogenicity.\n- The patent refers extensively to chimerism, transplantation monitoring, and biological sample mixture quantification; Quant is designed for rare disease and variant pathogenicity diagnostic certainty determination.\n- Quant’s method explicitly models false negative probabilities of missing variants (e.g., due to sequencing coverage gaps), not addressed in this patent.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis patent shares significant technical overlap with Quant in that both use probabilistic Bayesian models, explicit modeling of allele counts at polymorphic loci, genetic priors based on Hardy-Weinberg equilibrium, sequencing error modeling, and numerical optimization techniques to estimate fractions or probabilities related to nucleic acid mixtures. Both employ complex likelihood functions over genotypes and Bayesian marginalization.\n\nHowever, the patent is fundamentally directed to computational **deconvolution and quantification of contributor fractions** in mixed DNA samples from unknown genotypes (e.g., for chimerism testing) and does not claim or describe the integration of **prior probabilities of pathogenic variant observations combined with true/false positive/negative variant information to estimate genetic diagnosis posterior probabilities**, which is Quant’s core novelty.\n\nThe strong conceptual resemblance on Bayesian modeling of allele counts and error distributions, together with multi-locus likelihood frameworks and numerical optimization for fraction estimation, means the patent could potentially block some aspects if Quant’s claims or implementations intersect with mixture quantification or chimerism analysis domains. Given the sophistication and overlap of key computational methods, a detailed legal review is recommended to assess freedom to operate relative to Quant’s specific novelty and claims."]
  },
  "patent_US20200097835A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Device, system and method for assessing risk of variant-specific gene dysfunction\n- **Publication No.:** US20200097835A1\n- **Publication Date:** 2020-04-02\n- **Link:** https://patents.google.com/patent/US20200097835A1/en\n\n#### Abstract (excerpt)\n\n> \"A method may include generating multiple virtual progenies from multiple first virtual gametes and multiple second virtual gametes. Each virtual progeny may combine one of the first virtual gametes and one of the second virtual gametes. ... A computing server may input, for each virtual progeny, data associated with the first virtual gamete ... to a machine learning model to determine a first variant-specific gene dysfunction score corresponding to a target allele site. ... The computing server may derive, for each virtual progeny, a dysfunction likelihood score of the target allele site from the first variant-specific gene dysfunction score and the second variant-specific gene dysfunction score.\"\n\n#### Relevant Overlaps\n\n- Uses virtual progenies generated by combining virtual gametes from two potential parents to simulate possible offspring genomes.\n- Applies a neural network-based machine learning model to compute variant-specific gene dysfunction (VGD) scores for variants at given allele sites.\n- Combines variant dysfunction scores of parental alleles to derive a dysfunction likelihood score representing the genotype's disease risk.\n- Uses continuous trait models to quantify partial functionality or partial disease risk, not just binary classification.\n- Generates distributions of dysfunction likelihoods by simulating many virtual progenies, enabling assessment of disease risk and confidence intervals.\n- Incorporates multiple gene dysfunction components including clinical variant classifications, evolutionary constraint, population allele frequencies, mutation class, and pathogenic predictors.\n- Explicitly models homozygous and heterozygous effects and dominant effects in population-based scoring.\n- Uses evolutionary models and population-specific data to improve accuracy of variant pathogenicity and gene dysfunction likelihood.\n- Employs Bayesian or neural network approaches to integrate prior probabilities with variant data to estimate probability of a genetic diagnosis.\n- Can predict likelihood of disease in unobserved, preconception virtual offspring accounting for false negatives and unseen variants.\n- Provides continuous scoring with credible intervals reflecting diagnostic certainty.\n\n#### Key Differences\n\n- None significant with respect to the core technical innovation described.\n- The patent focuses heavily on a multi-node neural network combining diverse sources of evidence for variant dysfunction; this is a fundamental underpinning of Quant.\n- Detailed population- and evolutionary-selection metrics and integration with clinical data aligns closely with Quant.\n- The patent does not merely predict pathogenicity labels but models the likelihood of allele- and genotype-specific dysfunction, similar to Quant's core focus.\n- The use of virtual progeny and integration of multiple gene dysfunction components including population selection, evolutionary constraint, and clinical classification closely resembles Quant’s unique method.\n- While the patent cites its neural network and Bayesian integration, specific implementation details might differ but the underlying theory and method have strong parallels.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis patent describes technology that is highly similar to the Quant platform in using multi-source Bayesian/neural network integration of variant-specific dysfunction scores, evolutionary and population metrics, and clinical data to assess the likelihood of gene dysfunction and disease in simulated progeny. Both rely on generating virtual progeny by recombination of parental gametes, scoring dysfunction scores for each allele, and computing genotype dysfunction likelihoods in a continuous and probabilistic framework. It also uniquely integrates false negative probability and credible intervals for diagnosis confidence. Given the very close theoretical and technical correspondence—especially focusing on TP, FN scenarios, detailed population genetics, Bayesian models, and genotype functionality—there is significant potential overlap with Quant’s technology."]
  },
  "patent_US20230253070A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Systems and Methods for Detecting Cellular Pathway Dysregulation in Cancer Specimens\n- **Publication No.:** US20230253070A1\n- **Publication Date:** 2023-08-10\n- **Link:** https://patents.google.com/patent/US20230253070A1/en\n\n#### Abstract (excerpt)\n\n> \"Disclosed herein are systems, methods, and compositions useful for determining cellular pathway disruption comprising the use of RNA expression level information. ... This determined level of disruption can be used to (1) assist in the identification of genetic variants that alter pathway activity, (2) correlate identified variants with disease state and disease progression, and (3) identify therapeutics most likely to be effective and therapeutics that should be avoided.\"\n\n#### Relevant Overlaps\n\n- Both Quant and this patent integrate RNA expression data and genetic variation data to infer pathway disruption or disease state.\n- The patent focuses on training machine learning models using positive and negative control groups defined by genetic variation (including pathogenic variants) to detect pathway dysregulation.\n- It includes constructing pathway modules (e.g., RAS/RTK and PI3K pathways subdivided into modules) and training regression models (e.g., logistic or elastic net) based on RNA-seq data.\n- The use of transcriptome-derived pathway disruption scores to guide clinical diagnostics, therapy matching, and treatment response prediction is described.\n- The patent addresses filtering of training data to control for confounders (e.g., cancer type), and iterative refinement of genetic variant sets contributing to the model.\n- Explicit modeling of variants of unknown significance (VUS) via global dysregulation scores and integration of multi-module effects in pathway modeling.\n- Scoring samples based on differential expression of gene sets associated with pathways/modules, and using these scores for patient stratification.\n- Use of Bayesian or statistical methods for model training and evaluation, including cross-validation and threshold determination for dysregulation calling.\n- Generation of credible intervals and confidence metrics for pathway disruption scores is mentioned.\n- Incorporation of large public datasets (e.g., TCGA) and clinical outcomes data for validation and model training.\n- The workflow from data inputs (VCF, RNAseq, annotations), through feature selection, model training, to clinical reporting parallels Quant’s data flow.\n- Use of multi-omic input (DNA variants, RNA expression, methylation) integrated via machine learning into pathway disruption probability outputs.\n\n#### Key Differences\n\n- The patent focuses predominantly on identifying and scoring **cellular pathway dysregulation** at the *pathway/module* level using RNA expression patterns correlated with known pathogenic mutations.\n- The core of Quant’s novelty is **genome-wide prior probabilities** of observing pathogenic variants **integrated via Bayesian models with observed/missing variant data** to produce **posterior probabilities of a complete genetic diagnosis**, explicitly modeling false negatives and all classification possibilities (TP, FP, TN, FN) at variant and gene levels.\n- Quant uniquely quantifies **diagnostic certainty with credible intervals**, going beyond classification to probabilistic diagnosis confidence.\n- The patent does not explicitly teach or claim the use of **prior probabilities of pathogenic variant occurrence genome-wide** or the *integration of prior probabilities with potential false negatives* to compute a Bayesian posterior probability of disease-causing variant observation.\n- The patent does not address modeling **patient-level evidence synthesis of observed and unobserved variants to produce per-patient diagnosis probabilities**.\n- The patent’s Bayesian or regression models are primarily used to assess **transcriptional dysregulation signatures** as a correlate of pathway disruption, not to compute genome-wide variant pathogenicity or diagnosis probabilities integrating prior expectations.\n- Though it discusses treatment matching and therapy response, the method centers on **transcriptome-based pathway disruption inference**, not on **probability quantification of sequence variant pathogenicity or diagnosis completeness**.\n- The patent appears to avoid detailed modeling of **TP, FP, TN, FN outcomes** in a probabilistic framework applied jointly at variant and gene levels, which is integral to Quant.\n- Use of Bayesian credible intervals to reflect uncertainty on the **complete genetic diagnosis status** is unique to Quant.\n- The patent emphasizes **machine learning classification** of pathway dysregulation rather than probabilistic variant-level diagnostics combining observed and missing data.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n### Summary\n\nWhile US20230253070A1 and Quant both analyze genetic and transcriptomic data to infer disease-related changes, US20230253070A1 focuses on identifying transcriptional signatures of **pathway dysregulation** via machine learning on RNA expression using positive/negative cohorts defined by known pathogenic variants. It is essentially a **pathway-level classifier of transcriptional disruption**.\n\nQuant’s core novelty is the **Bayesian integration of genome-wide prior probabilities for pathogenic variants with observed patient variant data**, including modeling **false negatives and deriving posterior probabilities of complete genetic diagnosis**, providing **credible intervals for diagnostic certainty**. This is a distinct theoretical and practical approach focused on **quantifying confidence in genetic diagnosis at the variant and gene levels genome-wide**, rather than primarily classification of transcriptional signatures of pathway disruption.\n\nThus, although superficially related in addressing genomic data and disease variant interpretation, the two methods do not substantially overlap in their core theories or technical implementations. However, due to some similarity in terminology and use of machine learning on genomic and transcriptomic data for clinical assessment, a legal review is recommended to clarify possible claims coverage and freedom to operate status for Quant."]
  },
  "patent_US20240371472A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods of detecting somatic and germline variants in impure tumors\n- **Publication No.:** US20240371472A1\n- **Publication Date:** 2024-02-01\n- **Link:** [https://patents.google.com/patent/US20240371472A1/en](https://patents.google.com/patent/US20240371472A1/en)\n\n#### Abstract (excerpt)\n\n> \"A system is provided that considers allele fraction shifts as a function of copy number and clonal heterogeneity. The system leverages differences between allele frequencies to differentiate between somatic and normal variants in impure tumor samples... The expected allele frequencies can be calculated. The expected allele frequencies for somatic and germline differ with tumor content for different copy number alterations.\"\n\n#### Relevant Overlaps\n\n- Uses allele fraction modeling to distinguish somatic from germline variants in tumor samples without matched normal tissue.\n- Incorporates allele-specific copy number estimation and tumor-cell fraction (clonality) to model expected allele frequencies.\n- Employs Bayesian modeling to compute posterior probabilities that a variant is somatic, germline heterozygous, or homozygous.\n- Uses iterative expectation-maximization to jointly estimate copy number states, clonal fractions, and variant classification.\n- Models sequencing data using beta-binomial distributions for allele counts and Poisson for exon read depths.\n- Applies classifiers (including quadratic discriminant analysis and machine learning) to distinguish true variants from artifacts.\n- Integrates data across one or multiple samples from the same patient to improve somatic variant detection.\n- Explicit consideration of false positives, false negatives, and credible intervals is implicit through probabilistic modeling.\n- Partitioning genome into segments with at most one copy number alteration (circular binary segmentation).\n- Uses prior probabilities derived from population databases (e.g., 1000 Genomes, COSMIC) for germline and somatic mutation frequencies.\n- Models the impact of tumor purity and clonal heterogeneity on variant allele fractions.\n- Reports variant-level and gene-level posterior probabilities and classifications.\n\nThese elements align closely with Quant’s innovation in integrating prior probabilities with observed/missing variant data, using a Bayesian approach to calculate posterior probabilities of pathogenic variants considering TP/FN scenarios, allele frequencies, copy number states, and tumor clonality.\n\n#### Key Differences\n\n- The patent is focused on somatic versus germline variant calling in tumor samples in oncology, whereas Quant’s description emphasizes genome-wide prior probabilities of pathogenic variants accounting for all inheritance modes (autosomal dominant, recessive, and X-linked), and aims at providing diagnostic certainty credible intervals for complete genetic diagnoses, including accounting for unobserved false negatives genome-wide.\n- Quant highlights integration of multiple inheritance modes and broader genome-wide probability quantification, rather than focusing solely on somatic vs germline discrimination in tumors.\n- The patent emphasizes calling variants in tumor samples with or without matched normal and includes machine learning classifiers mainly for artifact filtering, while Quant's emphasis is on combining prior genome-wide variant probabilities with clinical variant databases and observed patient variant calls into a Bayesian diagnostic certainty.\n- Quant integrates prior genotype frequencies under Hardy-Weinberg Equilibrium and modes of inheritance, which is not explicitly claimed here.\n- Quant explicitly outputs credible intervals of diagnostic certainty, which is not described in the patent.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n_Reasoning:_ The patent’s claims recite a Bayesian model integrating allele fractions, copy number, tumor-cell fraction, and prior probabilities for classifying variants as somatic or germline using expectation-maximization and beta-binomial models. This framework is very similar to Quant’s approach in combining prior probabilities with observed data (including TP and FN considerations) to derive posterior probabilities for variant pathogenicity in clinical diagnostics. Although Quant addresses broader inheritance modes and diagnostic certainty intervals, the core allele fraction modeling with Bayesian posterior probabilities and integration of prior data exhibits significant conceptual overlap requiring further legal assessment.\n\n---"]
  },
  "patent_WO2018051072A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Methods and apparatus for identifying one or more genetic variants associated with disease in an individual or group of related individuals\n- **Publication No.:** WO2018051072A1\n- **Publication Date:** 2018-03-29\n- **Link:** https://patents.google.com/patent/WO2018051072A1/en\n\n#### Abstract (excerpt)\n\n> \"Methods and apparatus for identifying one or more genetic variants associated with a disease are disclosed. In one arrangement a method comprises receiving input data comprising a set of candidate genetic variants present in an individual or group of individuals. A set of candidate hypotheses is generated. Each candidate hypothesis comprises a set of one or more of the candidate genetic variants. Prioritisation data is received. The prioritisation data represents an initial prioritisation of the candidate hypotheses in relative order of likely validity. A plurality of update steps is performed. Each update step takes as input all of the prioritised candidate hypotheses from a preceding step and updates the prioritisation using update reference data. A prioritised list of candidate hypotheses is output after the updating of the prioritisation provided by the plurality of update steps.\"\n\n#### Relevant Overlaps\n\n- Use of **Bayesian probabilistic modeling** with a sequence of update steps (Bayesian updates) to refine posterior probabilities for candidate genetic variant hypotheses.\n- Generation of candidate hypotheses combining variant sets and inheritance modes (dominant, recessive, compound heterozygous, X-linked).\n- Integration of multiple sources of external reference data (allele frequency bins, variant consequence annotation, spatial clustering, gene lists) through update factors (Bayes factors).\n- Explicit modeling and inclusion of a **\"non-genetic cause\" hypothesis** in the candidate set.\n- Calculation of **posterior probabilities** for candidate hypotheses, enabling ranking by likelihood of being disease-causing.\n- Computation and reporting of the **individual contribution of each update step** (Bayes factor) to the final prioritisation, providing interpretability.\n- Management of variants irrespective of strict filtering thresholds—no candidate variant is discarded prematurely.\n- Incorporation of inheritance mode prior probabilities, including personalized priors based on parental phenotype and consanguinity.\n- Use of well-known databases (ClinVar, 1000 Genomes) for estimating distributions for pathogenic and non-pathogenic variants.\n- Patient-level genotype data input (VCF) and inheritance-context-aware modeling.\n- The updates explicitly rely on probability distributions over variants considered true positives (pathogenic) and true negatives (non-pathogenic), consistent with a framework integrating TP and FN evidence.\n\n#### Key Differences\n\n- The patent's described method focuses on **prioritising candidate variant hypotheses toward likely pathogenicity**, incorporating inheritance modes and various annotation metrics, but it does not explicitly describe estimating a **genome-wide prior probability of observing pathogenic variants per gene** under Hardy-Weinberg equilibrium as a foundational prior.\n- The patent focuses on generating a **posterior probability that a variant (or set thereof) is causative for disease** but does not explicitly model or report a **posterior probability that a patient truly harbors a disease-causing variant accounting systematically for false negatives (e.g., missed variants) or unsequenced regions**.\n- Quant’s core innovation is quantifying **confidence of a complete genetic diagnosis integrating observed and missing variant data**, explicitly modeling false negatives to produce uncertainty bounds (credible intervals). The patent does not disclose this comprehensive diagnostic certainty quantification.\n- The patent emphasizes a probabilistic prioritisation and ranking of candidate variants but stops short of the **genome-wide probabilistic modeling of variant observability and cumulative diagnostic confidence** that Quant embodies.\n- Quant specifically produces **credible intervals reflecting diagnostic uncertainty**, a feature not stated in this patent.\n- While both use Bayesian updating, the patent uses update steps based on variant annotations and gene lists but does **not detail integration of population genetics models like Hardy-Weinberg equilibrium to estimate prior variant occurrence probabilities genome-wide**.\n- The patent’s approach considers sets of variants and inheritance modes primarily to **increase sensitivity and reliability of identifying disease variants** rather than providing quantitative risk estimates for the entire genome or confidently assessing the **absence of a genetic cause** based on false negative modeling.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:** The patent WO2018051072A1 describes a Bayesian prioritisation framework for genetic variants combining candidate hypotheses and inheritance modes, updating probabilities via external data in a probabilistic model. This overlaps significantly with Quant’s Bayesian updating principles and the use of inheritance modes. However, Quant’s unique aspect of genome-wide prior probability modeling integrating false negatives and producing quantitative diagnostic confidence with credible intervals is not disclosed explicitly in this prior art. The overlap in Bayesian update methodology and integration of true positive/false negative concepts warrants cautious consideration in FTO analysis."]
  },
  "patent_WO2020049558A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method and system for identifying gene disorder in maternal blood\n- **Publication No.:** WO2020049558A1\n- **Publication Date:** 2020-03-19\n- **Link:** https://patents.google.com/patent/WO2020049558A1/en\n\n#### Abstract (excerpt)\n\n> \"A method of fetal genotyping, comprises receiving maternal genomic DNA (gDNA) data, maternal cell-free DNA (cfDNA) data, and paternal gDNA data of a pair parenting to a fetus. The data are analyzed to identify a first set of sites at which the parents are homozygous for different alleles, and a second set at which at least one of the parents has a mutation. For each site of the first set, a probability that a respective portion of the maternal cfDNA data is derived from the fetus is determined. Each site of the second set is classified according to the determined probabilities as being either fetal or maternal to genotype the fetus.\"\n\n#### Relevant Overlaps\n\n- The patent describes a method of non-invasive prenatal diagnosis (NIPD) via analysis of maternal cfDNA combined with parental genomic data for fetal genotyping.\n- The method involves:\n  - Identification of sites segregating between parents (homozygous for different alleles) and mutation sites in parents.\n  - Determining, for each site, the probability that aligned cfDNA fragments are fetal or maternal in origin.\n  - Using Bayesian procedures to integrate prior probabilities derived from parental genotypes with cfDNA data, including fragment length distributions as a key metric to help distinguish fetal versus maternal DNA.\n  - Application of machine learning or deep learning for recalibration of probabilities or direct end-to-end classification of fetal genotype.\n- The method explicitly models all possible fetal genotypes at each locus (e.g., 0/0, 0/1, 1/1), calculates likelihoods per read, integrates fragment size data, and uses parental genotype information to inform priors.\n- False negative probabilities are implicitly accounted for by considering the likelihoods of observing fetal alleles given technical and biological variability.\n- The use of posterior probabilities and credible intervals to quantify confidence in fetal genotyping echoes Quant’s unique feature of reporting diagnostic certainty intervals.\n- Technical specifics overlap substantially:\n  - Input data types: maternal cfDNA, maternal and paternal gDNA.\n  - Use of allele-specific fragment length distributions to improve inference.\n  - Bayesian integration of prior genotype probabilities with observed data.\n  - Machine learning recalibration of posterior probabilities.\n- The patent claims both Bayesian methods and end-to-end deep learning models for fetal genotyping that use probability outputs rather than simple classification scores.\n- Genotyping is applied genome-wide, across single nucleotide variants and indels, closely resembling Quant's genome-wide variant probability framework.\n- The methods explicitly distinguish true positives and false negatives in variant detection, aligning with Quant's key theoretical approach to modeling TP, FN, FP, and TN.\n\n#### Key Differences\n\n- Quant focuses on genome-wide **disease-causing variant probabilities** under Hardy-Weinberg equilibrium and integrates prior probabilities of observing pathogenic variants, modes of inheritance, and population allele frequency data.\n- The patent chiefly addresses **fetal genotyping** from maternal plasma DNA in non-invasive prenatal diagnosis, focusing on fetal variant detection in the context of parental variants.\n- Although the patent uses Bayesian methods and machine learning, it does so specifically for distinguishing fetal and maternal origin of cfDNA fragments and genotyping the fetus, rather than explicitly calculating genome-wide prior probabilities of disease-causing variants or providing credible intervals for a complete genetic diagnosis.\n- Quant integrates missing/unobserved data (false negatives, unsequenced regions) for confident diagnosis, whereas the patent focuses on assigning probabilities of fetal origin to observed fragments for fetal genotype calls.\n- The patent’s use of fragment length and SAM flags to discriminate fetal vs. maternal cfDNA reads, while innovative, is a different problem scope than Quant’s disease-focused genome-wide prior calculation.\n- The end goal of the patent is genotyping fetal variants noninvasively, while Quant’s scope includes quantifying the **probability of a complete genetic diagnosis** integrating variant observations genome-wide, which is broader.\n- Quant’s emphasis on genetic diagnosis certainty, inheritance modeling across all genes and diseases, and credible intervals is not explicitly disclosed in the patent.\n- The patent is clinically focused on the prenatal setting and symptoms of congenital or monogenic diseases, whereas Quant is broader in research and clinical genetics usage.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Explanation:**  \nThis patent shares a highly similar Bayesian framework that integrates parental genotype priors with observed cfDNA fragment-level data and machine learning recalibration to compute posterior probabilities for fetal genotype calls. Specific concepts such as modeling true positives, false negatives, applying empirical fetal fraction based on fragment lengths, and generating calibrated posterior probabilities closely resemble Quant’s core theoretical approach. However, the patent is specialized to non-invasive fetal genotyping rather than the genome-wide genetic diagnosis confidence modeling of Quant. Nevertheless, the technical overlap is substantial enough that Quant’s freedom to operate may be affected. Further detailed claim analysis and legal scrutiny is warranted to delineate the precise scope and possible design-arounds."]
  },
  "patent_WO2023014816A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Method and system for newborn screening for genetic diseases by whole genome sequencing\n- **Publication No.:** WO2023014816A1\n- **Publication Date:** 2023-01-26\n- **Link:** https://patents.google.com/patent/WO2023014816A1/en\n\n#### Abstract (excerpt)\n\n> \"The present disclosure provides a method and system for testing newborns for genetic diseases, diagnoses and implementing optimal treatments. The invention provides for rapid detection of genetic disease in newborns, as well as identification of available therapeutic interventions that may be rapidly implemented to prevent death or adverse complications characterized by the genetic disease.\"\n\n#### Relevant Overlaps\n\n- The patent discloses methods that:\n  - Determine comprehensive sets of genetic diseases amenable to treatment.\n  - Identify pathogenic or likely pathogenic variants for these diseases.\n  - Perform genetic sequencing (rapid WGS or exome sequencing) on patients (newborns).\n  - Analyze sequence data by comparing diplotypes to known variant sets for screening.\n  - Generate reports indicating positive screening results.\n  - Include a self-learning system that updates population allele frequencies and variant pathogenicity assertions dynamically based on results and confirmatory testing.\n  - Use natural language processing (NLP) on electronic health records (EHRs) to extract phenotypes for diagnosis.\n  - Automate variant interpretation using Bayesian models, machine learning, and phenotype-genotype correlations.\n  - Compute probabilities of diagnostic outcomes and provide confirmatory testing.\n  - Provide acute management guidance linked to molecular diagnoses (via Genome-To-Treatment system).\n  - Perform large-scale population screening and diagnosis integrated with variant frequency recalculation.\n  - Employ automated systems decreasing manual variant review burden.\n\n- The claims specify:\n  - Methods including recalculating population allele frequencies incorporating observed variant data.\n  - Detailed pipelines from disease and variant curation, sequencing, diplotype analysis, confirmatory testing, to clinical intervention.\n  - Use of sparse databases optimized for rapid genotype frequency recalculation at scale.\n  - Integration of phenotypic data extraction via NLP with variant analysis for provisional diagnosis.\n  - Bayesian statistical modeling and risk estimation for genetic disorders.\n  - Generation of reports delivering diagnosis probabilities and treatment recommendations.\n\n#### Key Differences\n\n- **Quant distinguishes itself by:**\n  - A core innovation focused on calculating genome-wide **prior probabilities** of observing pathogenic variants under Hardy-Weinberg equilibrium and across all inheritance modes.\n  - Explicit modeling and quantification of **false negatives (FN)** and **true positives (TP)** at variant and gene levels to compute **Bayesian posterior probabilities** of a **complete genetic diagnosis**, reflecting diagnostic **certainty with credible intervals**.\n  - Scalability to **genome-wide analyses**, integrating observed variant data and missing/unobserved data (including suboptimal coverage) explicitly into the Bayesian framework.\n  - Providing numerical probabilistic risk values, not just classification labels or pathogenicity scores.\n  - Quant’s unique output includes credible intervals for diagnostic confidence — an uncertainty quantification rarely addressed by others.\n  - Systems described in the patent emphasize variant filtering, positive screening identification, and management guidance but do **not explicitly quantify diagnostic confidence intervals incorporating FN estimates genome-wide** in a Bayesian posterior probability model as detailed in Quant.\n  - The patent's system, while comprising automated variant classification and scoring, focuses on screening and diagnosis primarily by detecting known pathogenic variants and variant pathogenicity assertions and updating them. Quant’s novelty is the explicit probabilistic modeling of diagnosis certainty integrating prior frequencies with observed variant data, including false negatives.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis patent shares significant technical overlap with Quant’s area in large-scale genome-based newborn screening, automated variant interpretation, integration of genotype and phenotype data, and provision of therapeutic guidance. It describes methods for identifying pathogenic variants and applying confirmatory testing, as well as recalculating allele frequencies and variant pathogenicity dynamically. It employs Bayesian models and NLP similarly.\n\nHowever, the precise innovation of Quant — specifically the explicit Bayesian framework calculating genome-wide prior probabilities, integrating false negative/true positive models to yield posterior probabilities of a complete genetic diagnosis with credible intervals — is not expressly disclosed here. The patent focuses more on variant identification, classification, screening positive determination, and management guidance, without explicitly modeling diagnostic confidence incorporating unobserved variant data probabilistically.\n\nBecause the disclosed methods cover core steps overlapping with Quant, particularly large-scale variant screening with population frequency updates and variant pathogenicity assertions, and have some Bayesian modeling for diagnosis, there is a potential overlap that warrants close consideration based on detailed claim construction and technical comparison."]
  },
  "patent_WO2025050071A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Probabilistic variant interpretation\n- **Publication No.:** WO2025050071A1\n- **Publication Date:** 2025-02-13 (publication date from metadata on linked page)\n- **Link:** https://patents.google.com/patent/WO2025050071A1/en\n\n#### Abstract (excerpt)\n\n> \"Examples may create input data for a causal machine learning model using pathogenicity evidence data associated with a genetic variant and a health condition. Examples may apply a causal machine learning model to the input data to produce a trained causal model. A graphical representation of the trained causal model may include nodes connected via acyclic directed edges. A first node of the nodes may represent a pathogenicity evidence variable related to the health condition. At least one second node may represent a cause of the pathogenicity evidence variable. At least one third node may represent an effect of the pathogenicity evidence variable. An acyclic directed edge may represent a relationship between two of the nodes. Examples may output predictive data sampled from the trained causal model.\"\n\n#### Relevant Overlaps\n\n- The patent discloses a **causal machine learning model** represented as a **probabilistic graphical model** (directed acyclic graph, DAG), where a central node represents **pathogenicity**, with upstream nodes as causes (e.g., protein function disruption, mRNA processing impacts) and downstream nodes as effects (e.g., patient phenotype, allele frequencies).\n- It employs **Bayesian inference and probabilistic modeling** to quantify relationships between pathogenicity evidence types.\n- The model integrates **multiple types of evidence**, including clinical data, population frequency data, functional experimental data, and splice site prediction models.\n- The training process involves **supervised learning with labeled pathogenicity data**, and the model outputs **posterior probabilities** (probability of pathogenicity, PoP).\n- The model explicitly accounts for **uncertainty and distributions**, allowing sampling of any node (including pathogenicity) to obtain probabilistic predictions.\n- Also disclosed is the use of **natural language processing (NLP)** applied to clinical phenotype data from test requisition forms to extract features predictive of diagnosis.\n- The described system produces **quantitative variant pathogenicity probabilities** and supports downstream clinical variant interpretation or diagnosis.\n- The patent describes **fitness and validation** processes based on performance metrics like AUROC for evaluating model quality.\n- It also includes a platform of multiple **machine learning-based evidence models**, which are evaluated, weighted, calibrated, and combined using Bayesian causal modeling to produce integrated pathogenicity estimates.\n- The patent outlines **iterative updating and integration of new evidence**, including mechanistic models and empirical data.\n\n#### Key Differences\n\n- The patent mainly focuses on producing **probability of pathogenicity for individual variants**, integrating multiple heterogeneous evidence types through a causal Bayesian network.\n- Although probabilistic and causal inference-based, it **does not explicitly mention modeling patient-level false negatives, missing variants or unsequenced regions with a diagnostic posterior probability accounting for TP, FP, TN, FN outcomes**, which is central to Quant’s novelty.\n- The focus is on variant interpretation and pathogenicity prediction, whereas **Quant uniquely quantifies the diagnostic confidence of a complete genetic diagnosis at the gene and genome level**, integrating prior probabilities with observed and missing variant data.\n- Quant explicitly models **mode of inheritance impacts on variant occurrence probabilities**, Hardy-Weinberg Equilibrium-based priors, and genome-wide prior probabilities of pathogenic variants per gene; this detail is absent or not emphasized in the patent.\n- The patent describes a **machine learning pipeline to predict pathogenicity of variants using multiple data sources and evidence models**, but does not clearly disclose the integration of variant observation probabilities with error modeling (false negatives) to yield **posterior probability of a diagnosis** with credible intervals reflecting certainty.\n- Use of **TP, FP, TN, FN outcomes and diagnostic-level Bayesian updating** distinguishing Quant’s approach is not explicitly recited.\n- Quant’s emphasis on **scalable genome-wide modeling for clinical diagnostic certainty reporting** and providing uncertainty bounds (credible intervals) for diagnosis rather than just pathogenicity predictions is distinctive.\n- The patent’s claims and description focus on variant-level pathogenicity modeling rather than directly supporting clinical genetic diagnosis confidence accounting for **missing variant data or sequencing coverage gaps**.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n---\n\n**Summary:**  \nThis patent discloses a complex Bayesian causal model for variant pathogenicity interpretation integrating multiple evidence types, which resembles the theoretic underpinning of Quant’s use of causal Bayesian models and evidence integration. However, it lacks explicit disclosure of the unique features of Quant that center on computing **genome-wide prior probabilities combined with observed and unobserved variant information** to yield a **posterior probability of a genetic diagnosis accounting for false negatives and detection uncertainty**. Quant’s modeling of TP, FP, TN, FN outcomes, Hardy-Weinberg-based variant occurrence priors, inheritance mode modeling, and diagnostic confidence intervals are not clearly described in this patent. This suggests that despite related methodology, the patent does not explicitly block Quant’s core innovation, but nevertheless, the strong similarity in Bayesian causal modeling to variant interpretation indicates potential overlap meriting further expert legal consideration."]
  },
  "patent_WO2025102060A1": {
    "publication_no": {},
    "title": {},
    "report_text": ["## Patent/Publication Analysis\n\n### Reference #1\n\n- **Title:** Accurate detection of origin of cell-free nucleic acids  \n- **Publication No.:** WO2025102060A1  \n- **Publication Date:** 2025-04-03 (publication date from source)  \n- **Link:** [https://patents.google.com/patent/WO2025102060A1/en](https://patents.google.com/patent/WO2025102060A1/en)\n\n#### Abstract (excerpt)\n\n> \"Techniques are provided for accurately detecting a mutation in a cell-free nucleic acid shed from a tissue (e.g., a tumor) into blood. An example technique can distinguish between a mutation in a cell-free nucleic acid molecule derived from blood cells and a mutation in a cell-free nucleic acid molecule derived from a tumor. A cell-free sample (e.g., plasma or serum) and a cellular sample (e.g., white blood cells in a buffy coat) can be sequenced. After applying filtering criteria to respective sets of sequence reads, a particular mutation can be detected in both the cell-free sample and the cellular sample. Confidence intervals for the detection of the mutation can be determined for both samples, with an upper bound for the cellular sample and a lower bound of the cell-free sample being used to determine the origin of the mutation in the cell-free sample.\"\n\n#### Relevant Overlaps\n\n- The patent method sequences both plasma (cell-free DNA) and buffy coat (cellular DNA) samples from the same subject to detect mutations.\n- Applies filtering criteria including number of reads supporting a mutation and position of the mutation within reads to reduce false positives.\n- Uses statistical confidence intervals (e.g., 95% CI) around variant allele frequencies in both samples.\n- Determines origin of mutation by comparing intervals: if the lower bound of plasma VAF confidence interval is greater than the upper bound of buffy coat VAF interval, mutation is designated as originating from non-hematopoietic tissue (tumor).\n- Includes additional classification to separate clonal hematopoiesis (CHIP), mosaicism, and germline based on variant allele frequency thresholds and gene lists.\n- Identifies mutations of hematopoietic origin that could confound tumor-derived mutation detection.\n- Embeds use of machine learning models trained on matched plasma and buffy coat data to classify mutations and predict phenotypes such as diagnosis, prognosis, and likely treatment benefit.\n- Describes a workflow integrating sequencing, filtering, statistics, and ML to identify tumor-derived mutations, excluding CHIP confounders.\n- Uses variant-level and gene-level probabilities and confidence intervals to interpret sequencing data.\n\n#### Key Differences\n\n- Quant’s uniqueness lies in genome-wide prior probability calculations of pathogenic variant occurrence integrating modes of inheritance and Hardy-Weinberg Equilibrium, which are aggregated into a Bayesian posterior probability quantifying **diagnostic confidence of a complete genetic diagnosis accounting for false negatives**.\n- The patent focuses primarily on origin attribution of individual mutations detected in plasma cfDNA by comparison with buffy coat sequences and confidence intervals; it does not explicitly describe modeling complete genetic diagnostic certainty or prior probabilities genome-wide.\n- The patent's main statistical approach is comparison of confidence intervals on observed allele frequencies for individual variants to assign origin. Quant’s method integrates prior probabilities of pathogenic variant presence and models false negatives explicitly into a posterior probability of the patient harboring a causative variant.\n- No explicit use of Hardy-Weinberg Equilibrium or genome-wide priors described in the patent.\n- Patent deals primarily with somatic mutation origin assignment in liquid biopsy for cancer; Quant’s method is broader, for interpreting germline pathogenic variants genome-wide across all inheritance modes.\n- Patent’s machine learning models assist classification and treatment benefit prediction but are not described to explicitly model posterior probabilities of diagnosis or integrate unobserved variant probabilities.\n- Use of TP, FP, TN, FN classification analogs is implicit in filtering but does not explicitly model these to output credible intervals of diagnostic confidence genome-wide.\n\n#### Conclusion\n\nPotential overlap — recommend legal review.\n\n**Rationale:**  \nThe patent discloses critical steps also used in Quant’s method, notably sequencing plasma and buffy coat samples, applying filtering to sequence reads, calculating confidence intervals on mutation allele frequencies in both compartments, and basing mutation origin attribution on the relationship of these confidence intervals. It deals with distinguishing true somatic tumor mutations from clonal hematopoiesis and germline variants using thresholds and gene lists. This is very close conceptually to Quant’s unique use of confidence intervals and classification of variants origin, which is essential to Quant’s Bayesian model input.\n\nHowever, it does not explicitly disclose or claim Bayesian integration of genome-wide prior probabilities, Hardy-Weinberg equilibrium modeling, or explicit posterior diagnostic probability calculation accounting for false negatives, which are key Quant innovations. Quant’s method extends beyond variant origin detection to quantifying whole-genome diagnostic certainty with credible intervals.\n\nGiven the significant technical overlap around using TP, FP, FN analog concepts to identify mutation origin through statistical intervals from paired plasma and buffy coat sequencing, this patent is potentially blocking or at least highly relevant prior art that requires careful legal assessment relative to Quant’s claims and specific novel aspects.\n\n---\n\n**Summary:**  \n- The patent describes a mutation origin determination method very similar in theory to Quant’s approach using observed data (TP-like), joint plasma/buffy coat sequencing, and confidence intervals to classify mutations as tumor- or blood-derived.\n- It does not explicitly disclose Quant’s prior probability genome-wide modeling or posterior diagnostic confidence quantification integrating unobserved variant probabilities.\n- High conceptual and methodological overlap in variant origin detection using confidence intervals and filtering criteria; this overlaps with Quant’s use of TP/FN concepts.\n- Legal review is recommended to assess claim scope relative to Quant’s unique Bayesian genome-wide diagnosis confidence approach."]
  }
}
